#### StructuralBottomReleaseFy Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Fy"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralBottomReleaseFy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralBottomReleaseFy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralBottomReleaseFy { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### YDir Property

---

|  |
| --- |
| ConicalSurface Class   See Also |

X axis of the local coordinate system associated with this cone.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public XYZ YDir { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property YDir As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ YDir { 	XYZ^ get (); } ``` |

# See Also

ConicalSurface Class

Autodesk.Revit.DB Namespace

#### LbForcePerFtSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol lb/ftÂ², indicating unit Pounds force per square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LbForcePerFtSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LbForcePerFtSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LbForcePerFtSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.DirectShapeFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failure definitions related to DirectShapes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static class DirectShapeFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class DirectShapeFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class DirectShapeFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures DirectShapeFailures

# See Also

BuiltInFailures DirectShapeFailures Members

Autodesk.Revit.DB Namespace

#### IsCurveReferenceValid Method

---

|  |
| --- |
| DividedPath Class   See Also |

This returns true if the reference represents a curve or edge that can be used to create a divided path.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool IsCurveReferenceValid( 	Document document, 	Reference curveReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsCurveReferenceValid ( _ 	document As Document, _ 	curveReference As Reference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsCurveReferenceValid( 	Document^ document,  	Reference^ curveReference ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

curveReference
:   Type:  Autodesk.Revit.DB Reference
     The reference.

#### Return Value

True if the reference can be used to create a divided path, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### Item Property

---

|  |
| --- |
| DuctSizeSettings Class   See Also |

Get the DuctSizes for this DuctShape.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public DuctSizes this[ 	DuctShape ductShape ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Default Property Item ( _ 	ductShape As DuctShape _ ) As DuctSizes 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property DuctSizes^ default[DuctShape ductShape] { 	DuctSizes^ get (DuctShape ductShape); } ``` |

#### Parameters

ductShape
:   Type:  Autodesk.Revit.DB.Mechanical DuctShape
     The duct shape.

#### Return Value

The DuctSizes for this DuctShape.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | There is no DuctSizes for this DuctShape. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

DuctSizeSettings Class

Autodesk.Revit.DB.Mechanical Namespace

#### SetCutBackgroundPatternVisible Method

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

Sets the visibility of the cut face background fill pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public OverrideGraphicSettings SetCutBackgroundPatternVisible( 	bool fillPatternVisible ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetCutBackgroundPatternVisible ( _ 	fillPatternVisible As Boolean _ ) As OverrideGraphicSettings ``` |

| Visual C++ |
| --- |
| ``` public: OverrideGraphicSettings^ SetCutBackgroundPatternVisible( 	bool fillPatternVisible ) ``` |

#### Parameters

fillPatternVisible
:   Type:  System Boolean
     Value of the visibility of the cut face background fill pattern.

#### Return Value

Reference to the changed object.

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### ComputeClosestPoints Method

---

|  |
| --- |
| Curve Class   See Also |

Find the closest points between two curves. Closest points mean closest pairs of points, each pair consisting of a point on this, say P1, and a point on other curve, say P2. P1 and P2 are closest locally. Each pairs of closest points will be represented by the corresponding parameter values with respect to the two curves and the 3d points. A closest pair is also known as a pair of critical points of the distance function between points of the two curves. If the input parameter returnAllCriticalPoints is set to false, then the function will return only pairs with minimum distance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public void ComputeClosestPoints( 	Curve otherCurve, 	bool withinThisCurveBounds, 	bool withinOtherCurveBounds, 	bool returnAllCriticalPnts, 	out IList<ClosestPointsPairBetweenTwoCurves> resultList ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ComputeClosestPoints ( _ 	otherCurve As Curve, _ 	withinThisCurveBounds As Boolean, _ 	withinOtherCurveBounds As Boolean, _ 	returnAllCriticalPnts As Boolean, _ 	<OutAttribute> ByRef resultList As IList(Of ClosestPointsPairBetweenTwoCurves) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ComputeClosestPoints( 	Curve^ otherCurve,  	bool withinThisCurveBounds,  	bool withinOtherCurveBounds,  	bool returnAllCriticalPnts,  	[OutAttribute] IList<ClosestPointsPairBetweenTwoCurves^>^% resultList ) ``` |

#### Parameters

otherCurve
:   Type:  Autodesk.Revit.DB Curve
     The specified curve used to compute closest points to this curve.

withinThisCurveBounds
:   Type:  System Boolean
     If this parameter is true only the solutions that are between this curve bounds will be returned. This curve must be bound if this parameter is true.

withinOtherCurveBounds
:   Type:  System Boolean
     If this parameter is true only the solutions that are between other curve bounds will be returned. The other curve must be bound if this parameter is true.

returnAllCriticalPnts
:   Type:  System Boolean
     The input parameter returnAllCriticalPnts is used to tell if all the critical points of the distance function are to be returned.

resultList
:   Type:  System.Collections.Generic IList   ClosestPointsPairBetweenTwoCurves   %
     Output parameter that will contain the results collection.

# Remarks

The output list of closest points contains one entry for each pair of closest points. The following is the meaning of every ClosestPointsPairBetweenTwoCurves's members:

* XYZPointOnFirstCurve is the closest point on the first curve;
* XYZPointOnSecondCurve is the closest point on the second curve;
* ParameterOnFirstCurve is the raw (not normalized) parameter on the first curve
* ParameterOnSecondCurve is the raw (not normalized) parameter on the second curve
* Distance is the distance from the closest point on the first curve to the closest point on the second curve.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when otherCurve argument is null. Thrown when resultArray is null. |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | Thrown when withinThisCurveBounds is true and this curve is unbounded. Thrown when withinOtherCurveBounds is true and other curve is unbounded. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the method failed. For example the problem has infinitely many solutions such as two parallel lines or two concentric circles, or in other singular cases that the method currently cannot handle, such as evaluating the closest points between a spline and a line, and the spline contains a flat segment (all points on the segment have zero curvature), and the closest points lie within that flat segment. |

# See Also

Curve Class

Autodesk.Revit.DB Namespace

#### RailExtensionStyle Enumeration

---

|  |
| --- |
| See Also |

The extension style of the rail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailExtensionStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailExtensionStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class RailExtensionStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| None | The rail extends to nothing |
| Wall | The rail extends to wall. |
| Floor | The rail extends to floor. |
| Post | The rail extends to post. |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### Evaluate Method

---

|  |
| --- |
| Edge Class   See Also |

Evaluates a parameter on the edge.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Evaluate( 	double param ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Evaluate ( _ 	param As Double _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ Evaluate( 	double param ) ``` |

#### Parameters

param
:   Type:  System Double
     The parameter to be evaluated, in [0,1].

# See Also

Edge Class

Autodesk.Revit.DB Namespace

#### StairsAttrStringerThickness Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Stringer Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrStringerThickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrStringerThickness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrStringerThickness { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralAnalyticalColumnHorizontalProjectionPlane Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Horizontal Projection"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralAnalyticalColumnHorizontalProjectionPlane { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralAnalyticalColumnHorizontalProjectionPlane As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralAnalyticalColumnHorizontalProjectionPlane { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarSystemBottomMajorMatchesBottomMinor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Major and Minor Layers Match"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemBottomMajorMatchesBottomMinor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemBottomMajorMatchesBottomMinor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemBottomMajorMatchesBottomMinor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetControlPoints Method

---

|  |
| --- |
| Form Class   See Also |

Given an edge or a curve or a face, return all control points lying on it (in form of geometry references).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ReferenceArray GetControlPoints( 	Reference curveOrEdgeOrFaceReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetControlPoints ( _ 	curveOrEdgeOrFaceReference As Reference _ ) As ReferenceArray ``` |

| Visual C++ |
| --- |
| ``` public: ReferenceArray^ GetControlPoints( 	Reference^ curveOrEdgeOrFaceReference ) ``` |

#### Parameters

curveOrEdgeOrFaceReference
:   Type:  Autodesk.Revit.DB Reference
     The reference of an edge or curve or face.

#### Return Value

Reference array containing all control points lying on it.

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### RoomVolumeNegativeWarn Property

---

|  |
| --- |
| BuiltInFailures EnergyAnalysisFailures Class   See Also |

[Room] has a negative volume? [Room] will be ignored in the energy analysis model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RoomVolumeNegativeWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomVolumeNegativeWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RoomVolumeNegativeWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EnergyAnalysisFailures Class

Autodesk.Revit.DB Namespace

#### CalculateStrokesPerArea Method

---

|  |
| --- |
| FillGrid Class   See Also |

Calculates the number of the segments of the pattern per unit area.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double CalculateStrokesPerArea() ``` |

| Visual Basic |
| --- |
| ``` Public Function CalculateStrokesPerArea As Double ``` |

| Visual C++ |
| --- |
| ``` public: double CalculateStrokesPerArea() ``` |

#### Return Value

The strokes per area.

# See Also

FillGrid Class

Autodesk.Revit.DB Namespace

#### CreateNURBSSurface Method (Int32, Int32, IList(Double), IList(Double), IList(XYZ), IList(Double), Boolean, BoundingBoxUV)

---

|  |
| --- |
| BRepBuilderSurfaceGeometry Class   See Also |

Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static BRepBuilderSurfaceGeometry CreateNURBSSurface( 	int degreeU, 	int degreeV, 	IList<double> knotsU, 	IList<double> knotsV, 	IList<XYZ> controlPoints, 	IList<double> weights, 	bool bReverseOrientation, 	BoundingBoxUV surfaceEnvelope ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateNURBSSurface ( _ 	degreeU As Integer, _ 	degreeV As Integer, _ 	knotsU As IList(Of Double), _ 	knotsV As IList(Of Double), _ 	controlPoints As IList(Of XYZ), _ 	weights As IList(Of Double), _ 	bReverseOrientation As Boolean, _ 	surfaceEnvelope As BoundingBoxUV _ ) As BRepBuilderSurfaceGeometry ``` |

| Visual C++ |
| --- |
| ``` public: static BRepBuilderSurfaceGeometry^ CreateNURBSSurface( 	int degreeU,  	int degreeV,  	IList<double>^ knotsU,  	IList<double>^ knotsV,  	IList<XYZ^>^ controlPoints,  	IList<double>^ weights,  	bool bReverseOrientation,  	BoundingBoxUV^ surfaceEnvelope ) ``` |

#### Parameters

degreeU
:   Type:  System Int32
     The degree of the spline in the u-direction; must be positive.

degreeV
:   Type:  System Int32
     The degree of the spline in the v-direction; must be positive.

knotsU
:   Type:  System.Collections.Generic IList   Double
     Knot values in the u-direction. The number of knots in the u-direction must be at least 2 \* (degreeU + 1).

knotsV
:   Type:  System.Collections.Generic IList   Double
     Knot values in the v-direction. The number of knots in the v-direction must be at least 2 \* (degreeV + 1).

controlPoints
:   Type:  System.Collections.Generic IList   XYZ
     One dimensional array of points representing the two dimensional net of control points of the NURBS surface in u and v directions.

    The total number of control points must equal numControlPtsU times numControlPtsV, where numControlPtsU and numControlPtsV are the numbers of control points in u and v directions, and they must satisfy the following conditions:

    * numControlPtsU = number of knots in u - degreeU - 1.
    * numControlPtsV = number of knots in v - degreeV - 1.

    The convention for 2d (idxU, idxV) to 1d (idx) conversion of array indexes: idxV first. That is, idxU is outer loop and idxV is inner loop. In other words, idx = idxU \* numControlPtsV + idxV.

weights
:   Type:  System.Collections.Generic IList   Double
     Array of weights assigned to the control points. The number of weights must equal the number of control points. All weights should be greater than zero.

bReverseOrientation
:   Type:  System Boolean
     If true, the surface's orientation is opposite to the canonical parametric orientation, otherwise it is the same. The canonical parametric orientation is a counter-clockwise sense of rotation in the uv-parameter plane. Extrinsically, the oriented normal vector for the canonical parametric orientation points in the direction of the cross product dS/du x dS/dv, which S(u, v) is the parameterized surface.

surfaceEnvelope
:   Type:  Autodesk.Revit.DB BoundingBoxUV
     Envelope of the surface in the uv parametric domain. Defines the domain of interest for the created surface. This is typically used to identify the domain of the face that references the surface in question. Expected to either be null or define a valid domain.

# Remarks

A rational polynomial is a quotient of two polynomials; this includes a polynomial, which can be thought of as a quotient with denominator equal to 1. If all the weights are equal, then the NURBS surface will be a piecewise polynomial surface.This class does not handle periodic Nurbs surfaces.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The U-degree value must be at least 1. -or- The V-degree value must be at least 1. -or- The number of knots in the U direction must be at least 2 times the U-degree plus 1. -or- The number of knots in the V direction must be at least 2 times the V-degree plus 1. -or- The number of control points must equal (number of U-knots - U-degree - 1) \* (number of V-knots - V-degree - 1). -or- The number of weights must be the same as the number of control points and all weights must be positive or all zero. -or- The input data does not define a valid Nurbs surface. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The Nurbs surface could not be converted for use in Revit. It may have C2-discontinuities or be too large. |

# See Also

BRepBuilderSurfaceGeometry Class

CreateNURBSSurface Overload

Autodesk.Revit.DB Namespace

#### DestinationFontName Property

---

|  |
| --- |
| ExportFontInfo Class   See Also |

The destination font name (the name of the font in the exported format).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string DestinationFontName { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DestinationFontName As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ DestinationFontName { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ExportFontInfo Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| MEPSection Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace

#### MismatchVoltageLineToLine Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Line Voltage for [Element] (The Line to Line Voltage is specified in the assigned Distribution System).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MismatchVoltageLineToLine { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MismatchVoltageLineToLine As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MismatchVoltageLineToLine { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.MultiReferenceAnnotationFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about MultiReferenceAnnotations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class MultiReferenceAnnotationFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class MultiReferenceAnnotationFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class MultiReferenceAnnotationFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures MultiReferenceAnnotationFailures

# See Also

BuiltInFailures MultiReferenceAnnotationFailures Members

Autodesk.Revit.DB Namespace

#### ColumnBaseAttachJustificationParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Attachment Justification At Base"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ColumnBaseAttachJustificationParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ColumnBaseAttachJustificationParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ColumnBaseAttachJustificationParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CurtainOrStackedWallDisallowedForCrossSectionType Property

---

|  |
| --- |
| BuiltInFailures WallFailures Class   See Also |

Curtain wall types and Stacked wall types are not allowed for this wall's cross-section type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CurtainOrStackedWallDisallowedForCrossSectionType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtainOrStackedWallDisallowedForCrossSectionType As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CurtainOrStackedWallDisallowedForCrossSectionType { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallFailures Class

Autodesk.Revit.DB Namespace

#### ExportMullions Property

---

|  |
| --- |
| EnergyAnalysisDetailModelOptions Class   See Also |

Indicates if to specify the setting for exporting mullions.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool ExportMullions { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExportMullions As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ExportMullions { 	bool get (); 	void set (bool value); } ``` |

# Remarks

When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical shading surface is produced from a mullion based on its centerline, thickness and offset.

# See Also

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace

#### ViewSolarstudySunIntensityValue Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Sun intensity"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewSolarstudySunIntensityValue { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewSolarstudySunIntensityValue As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewSolarstudySunIntensityValue { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LoadCaseId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Load Case"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadCaseId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadCaseId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadCaseId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.ImportExportFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Import and Export.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static class ImportExportFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class ImportExportFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class ImportExportFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures ImportExportFailures

# See Also

BuiltInFailures ImportExportFailures Members

Autodesk.Revit.DB Namespace

#### RemoveSizeTable Method

---

|  |
| --- |
| FamilySizeTableManager Class   See Also |

Removes the FamilySizeTable of a given name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool RemoveSizeTable( 	string tableName ) ``` |

| Visual Basic |
| --- |
| ``` Public Function RemoveSizeTable ( _ 	tableName As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool RemoveSizeTable( 	String^ tableName ) ``` |

#### Parameters

tableName
:   Type:  System String
     The FamilySizeTable name.

#### Return Value

True if successful, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FamilySizeTableManager Class

Autodesk.Revit.DB Namespace

#### SetupBrowserData Method

---

|  |
| --- |
| IExternalResourceServer Interface   See Also |

Implement this method to setup external resource browser data which will be accessed in Revit external resource browser UI.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` void SetupBrowserData( 	ExternalResourceBrowserData browseData ) ``` |

| Visual Basic |
| --- |
| ``` Sub SetupBrowserData ( _ 	browseData As ExternalResourceBrowserData _ ) ``` |

| Visual C++ |
| --- |
| ``` void SetupBrowserData( 	ExternalResourceBrowserData^ browseData ) ``` |

#### Parameters

browseData
:   Type:  Autodesk.Revit.DB ExternalResourceBrowserData
     The input context to match the external resources and browser results returned by the server.

# Remarks

If errors occur during setup, store this information externally, and then retrieve and deal with the errors during the call to HandleBrowseResult() of your IExternalResourceUIServer.

# See Also

IExternalResourceServer Interface

Autodesk.Revit.DB Namespace

#### GetEnumerator Method

---

|  |
| --- |
| Definitions Class   See Also |

Retrieves an enumerator to the collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<Definition> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of Definition) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<Definition^>^ GetEnumerator() ``` |

#### Return Value

The enumerator.

#### Implements

 IEnumerable T GetEnumerator

# See Also

Definitions Class

Autodesk.Revit.DB Namespace

#### GetEnumerator Method

---

|  |
| --- |
| SymbolicCurveArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator^ GetEnumerator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

#### Implements

 IEnumerable GetEnumerator

# See Also

SymbolicCurveArray Class

Autodesk.Revit.DB Namespace

#### TileHorizontalCount Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Tile Count" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TileHorizontalCount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TileHorizontalCount As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TileHorizontalCount { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 100".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### RoomConditionTypeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Condition Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomConditionTypeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomConditionTypeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomConditionTypeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FailureDueToConflicts Property

---

|  |
| --- |
| DocumentSaveToCentralProgressChangedEventArgs Class   See Also |

Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public bool FailureDueToConflicts { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FailureDueToConflicts As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool FailureDueToConflicts { 	bool get (); } ``` |

# See Also

DocumentSaveToCentralProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### ConnectTo Method

---

|  |
| --- |
| Connector Class   See Also |

Make connection between two connectors.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void ConnectTo( 	Connector connector ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ConnectTo ( _ 	connector As Connector _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ConnectTo( 	Connector^ connector ) ``` |

#### Parameters

connector
:   Type:  Autodesk.Revit.DB Connector
     Indicate the connector will be connected to.

# Remarks

Connection success may create a new Fitting between two connectors, if necessary.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when argument is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Argument is invalid. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when two connectors with different domain types. Thrown when these two connectors fail to connect each other. Thrown when connection already exists. |

# See Also

Connector Class

Autodesk.Revit.DB Namespace

#### VersionBuild Property

---

|  |
| --- |
| Application Class   See Also |

Returns the internal build number of the Autodesk Revit application.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string VersionBuild { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VersionBuild As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ VersionBuild { 	String^ get (); } ``` |

# Remarks

This property can be used by your application to find the version of Autodesk Revit against which your application is running. Based on this information your application can report if it is able to work correctly with that version of Autodesk Revit.

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### MetallicpaintPearlColorByObject Property

---

|  |
| --- |
| MetallicPaint Class   See Also |

The property labeled "Color By Object" from the "MetallicPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string MetallicpaintPearlColorByObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MetallicpaintPearlColorByObject As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ MetallicpaintPearlColorByObject { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace

#### RebarReinforcementData Class

---

|  |
| --- |
| Members   See Also |

class containing the id and the end of rebar on which the coupler stays

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public class RebarReinforcementData : ReinforcementData ``` |

| Visual Basic |
| --- |
| ``` Public Class RebarReinforcementData _ 	Inherits ReinforcementData ``` |

| Visual C++ |
| --- |
| ``` public ref class RebarReinforcementData : public ReinforcementData ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure ReinforcementData
  Autodesk.Revit.DB.Structure RebarReinforcementData

# See Also

RebarReinforcementData Members

Autodesk.Revit.DB.Structure Namespace

#### Fascia Class

---

|  |
| --- |
| Members   See Also |

An object that represents a fascia within the Autodesk Revit project.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class Fascia : HostedSweep ``` |

| Visual Basic |
| --- |
| ``` Public Class Fascia _ 	Inherits HostedSweep ``` |

| Visual C++ |
| --- |
| ``` public ref class Fascia : public HostedSweep ``` |

# Remarks

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB HostObject
  Autodesk.Revit.DB HostedSweep
  Autodesk.Revit.DB.Architecture Fascia

# See Also

Fascia Members

Autodesk.Revit.DB.Architecture Namespace

#### StairsAttrNumMidStringers Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Middle Stringers"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrNumMidStringers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrNumMidStringers As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrNumMidStringers { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsOverridden Property

---

|  |
| --- |
| ScheduleField Class   See Also |

Indicates if the field is overridden or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsOverridden { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsOverridden As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsOverridden { 	bool get (); } ``` |

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, ElementId, ElementId, ElementId, RailingPlacementPosition)

---

|  |
| --- |
| Railing Class   See Also |

Creates new railings with the specified railing type on all sides of a stairs instance in a  MultistoryStairs  element.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static ISet<ElementId> Create( 	Document document, 	ElementId multistoryStairsId, 	ElementId levelId, 	ElementId railingTypeId, 	RailingPlacementPosition placePosition ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	multistoryStairsId As ElementId, _ 	levelId As ElementId, _ 	railingTypeId As ElementId, _ 	placePosition As RailingPlacementPosition _ ) As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ISet<ElementId^>^ Create( 	Document^ document,  	ElementId^ multistoryStairsId,  	ElementId^ levelId,  	ElementId^ railingTypeId,  	RailingPlacementPosition placePosition ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

multistoryStairsId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the  MultistoryStairs  that contains the stairs which will be the host of this railing. The stairs should have no associated railings yet.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The level of stairs on which the new railing will be created. The level should be one of levels defining the  MultistoryStairs  element.

railingTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The railing type of the new railing to be created.

placePosition
:   Type:  Autodesk.Revit.DB.Architecture RailingPlacementPosition
     The placement position of the new railing.

#### Return Value

The new railing instances successfully created on the stairs.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The railingTypeId is not a railing type. -or- The ElementId levelId is not a Level. -or- The levelId is not a level of  MultistoryStairs  stairs element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | The multistoryStairsId already has associated railings or is in editing mode so association of railings is not permitted. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

Railing Class

Create Overload

Autodesk.Revit.DB.Architecture Namespace

#### GreenBuilding Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Green Building Properties"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GreenBuilding { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GreenBuilding As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GreenBuilding { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### ScheduleType Property

---

|  |
| --- |
| PanelScheduleData Class   See Also |

The panel schedule type of this panel schedule

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PanelScheduleType ScheduleType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ScheduleType As PanelScheduleType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property PanelScheduleType ScheduleType { 	PanelScheduleType get (); } ``` |

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### CalPerS Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol cal/s, indicating unit Calories per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CalPerS { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CalPerS As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CalPerS { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### ExternalResourceType Class

---

|  |
| --- |
| Members   See Also |

A type class used to distinguish between different kinds of external resource.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class ExternalResourceType : GuidEnum ``` |

| Visual Basic |
| --- |
| ``` Public Class ExternalResourceType _ 	Inherits GuidEnum ``` |

| Visual C++ |
| --- |
| ``` public ref class ExternalResourceType : public GuidEnum ``` |

# Remarks

Revit elements can consume multiple types of external resource data, provided by one or more external servers. Conversely, external servers can support one, or more than one, type of external resource.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB GuidEnum
  Autodesk.Revit.DB ExternalResourceType

# See Also

ExternalResourceType Members

Autodesk.Revit.DB Namespace

#### GetSizeCount Method

---

|  |
| --- |
| DuctSizeSettings Class   See Also |

Get the size count of the duct size table. The duct shape determines the location of the size in the size table.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int GetSizeCount( 	DuctShape shape ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSizeCount ( _ 	shape As DuctShape _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetSizeCount( 	DuctShape shape ) ``` |

#### Parameters

shape
:   Type:  Autodesk.Revit.DB.Mechanical DuctShape
     The shape of duct.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DuctSizeSettings Class

Autodesk.Revit.DB.Mechanical Namespace

#### CanNotDeleteLastOpenView Property

---

|  |
| --- |
| BuiltInFailures ViewFailures Class   See Also |

Deleting of all open views in a project is not allowed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CanNotDeleteLastOpenView { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CanNotDeleteLastOpenView As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CanNotDeleteLastOpenView { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ViewFailures Class

Autodesk.Revit.DB Namespace

#### StairsAttrTextFont Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Text Font"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrTextFont { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrTextFont As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrTextFont { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CommonTintToggle Property

---

|  |
| --- |
| Generic Class   See Also |

The property labeled "Tint" from the "Generic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CommonTintToggle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CommonTintToggle As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CommonTintToggle { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Generic Class

Autodesk.Revit.DB.Visual Namespace

#### CannotCreateOpeningRectangularArcWall Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Creation of a Rectangular Arc Wall Opening failed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateOpeningRectangularArcWall { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateOpeningRectangularArcWall As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateOpeningRectangularArcWall { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors Property

---

|  |
| --- |
| BuiltInFailures DividedSurfaceFailures Class   See Also |

Curve elements which form chains connecting points shared by more than two curve elements are ignored.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DividedSurfaceFailures Class

Autodesk.Revit.DB Namespace

#### Location Property

---

|  |
| --- |
| WorksharedOperationProgressChangedEventArgs Class   See Also |

Full path of the central model which is to be operated.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public string Location { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Location As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Location { 	String^ get (); } ``` |

# Remarks

For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.

# See Also

WorksharedOperationProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### CannotDrawWallsError Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Can't make Wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDrawWallsError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDrawWallsError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDrawWallsError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### LineLightShape Class

---

|  |
| --- |
| Members   See Also |

This class encapsulates a line light shape.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class LineLightShape : LightShape ``` |

| Visual Basic |
| --- |
| ``` Public Class LineLightShape _ 	Inherits LightShape ``` |

| Visual C++ |
| --- |
| ``` public ref class LineLightShape : public LightShape ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Lighting LightShape
  Autodesk.Revit.DB.Lighting LineLightShape

# See Also

LineLightShape Members

Autodesk.Revit.DB.Lighting Namespace

#### AlreadyCopiedAndStopWatch Property

---

|  |
| --- |
| BuiltInFailures CopyMonitorFailures Class   See Also |

Element has already been copied. Stop existing monitoring to copy again.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AlreadyCopiedAndStopWatch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AlreadyCopiedAndStopWatch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AlreadyCopiedAndStopWatch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyMonitorFailures Class

Autodesk.Revit.DB Namespace

#### CurveDriverError Property

---

|  |
| --- |
| BuiltInFailures GeometryFailures Class   See Also |

Element's internal join data is corrupt.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CurveDriverError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurveDriverError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CurveDriverError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeometryFailures Class

Autodesk.Revit.DB Namespace

#### SetSegments Method

---

|  |
| --- |
| FillGrid Class   See Also |

Sets the segments to the fill grid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetSegments( 	IList<double> segArr ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSegments ( _ 	segArr As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSegments( 	IList<double>^ segArr ) ``` |

#### Parameters

segArr
:   Type:  System.Collections.Generic IList   Double
     The segments to be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FillGrid Class

Autodesk.Revit.DB Namespace

#### ContainsOtherOutline Method

---

|  |
| --- |
| Outline Class   See Also |

Determine if this Outline contains another Outline to within tolerance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool ContainsOtherOutline( 	Outline otherOutline, 	double tolerance ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ContainsOtherOutline ( _ 	otherOutline As Outline, _ 	tolerance As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool ContainsOtherOutline( 	Outline^ otherOutline,  	double tolerance ) ``` |

#### Parameters

otherOutline
:   Type:  Autodesk.Revit.DB Outline
     The outline to test for containment.

tolerance
:   Type:  System Double
     The tolerance to use when determining whether the point is contained. Defaults to zero.

#### Return Value

True if this outline contains the given outline, or false otherwise.

# Remarks

If the tolerance is positive, the other Outline may extend the tolerance distance outside of this Outline in each coordinate. If the tolerance is negative, the other Outline must lie at least the tolerance distance inside of this Outline in each coordinate to be a match.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

Outline Class

Autodesk.Revit.DB Namespace

#### NumberofPeople Property

---

|  |
| --- |
| Space Class   See Also |

Get or set the Number of People of the Space.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public double NumberofPeople { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property NumberofPeople As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double NumberofPeople { 	double get (); 	void set (double value); } ``` |

# Remarks

This property is used to get or set Number of People of the Space.

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace

#### CreateBlendGeometry Method (CurveLoop, CurveLoop, ICollection(VertexPair), SolidOptions)

---

|  |
| --- |
| GeometryCreationUtilities Class   See Also |

Creates a solid by blending two closed curve loops lying in non-coincident planes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static Solid CreateBlendGeometry( 	CurveLoop firstLoop, 	CurveLoop secondLoop, 	ICollection<VertexPair> vertexPairs, 	SolidOptions solidOptions ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateBlendGeometry ( _ 	firstLoop As CurveLoop, _ 	secondLoop As CurveLoop, _ 	vertexPairs As ICollection(Of VertexPair), _ 	solidOptions As SolidOptions _ ) As Solid ``` |

| Visual C++ |
| --- |
| ``` public: static Solid^ CreateBlendGeometry( 	CurveLoop^ firstLoop,  	CurveLoop^ secondLoop,  	ICollection<VertexPair^>^ vertexPairs,  	SolidOptions^ solidOptions ) ``` |

#### Parameters

firstLoop
:   Type:  Autodesk.Revit.DB CurveLoop
     The first curve loop. The loop must be a closed planar loop without intersections or degeneracies. No orientation conditions are imposed. The loop must be a closed planar loop without intersections or degeneracies. No orientation conditions are imposed. The loop may not contain just one closed curve - split such a loop into two or more curves beforehand.

secondLoop
:   Type:  Autodesk.Revit.DB CurveLoop
     The second curve loop, satisfying the same conditions as the first loop. The planes of the first and second loops must not be coincident, but they need not be parallel.

vertexPairs
:   Type:  System.Collections.Generic ICollection   VertexPair
     This input specifies how the two profile loops should be connected. If null, the function chooses vertex connections that will result in a geometrically reasonable blend.

solidOptions
:   Type:  Autodesk.Revit.DB SolidOptions
     The optional information to control the properties of the Solid.

#### Return Value

The requested solid.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The first profile CurveLoop do not satisfy the input requirements. -or- The second profile CurveLoop do not satisfy the input requirements. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

GeometryCreationUtilities Class

CreateBlendGeometry Overload

Autodesk.Revit.DB Namespace

#### RoomGeometryCannotFindFreeFacesBoundingElement Property

---

|  |
| --- |
| BuiltInFailures EnergyAnalysisFailures Class   See Also |

An error occurred while trying to find the free part of a face of the bounding geometry for [Room] when processing the room-bounding element [Name]. The free part of the face is found by subtracting the portions of the face that overlap various room-bounding element faces.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RoomGeometryCannotFindFreeFacesBoundingElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomGeometryCannotFindFreeFacesBoundingElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RoomGeometryCannotFindFreeFacesBoundingElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EnergyAnalysisFailures Class

Autodesk.Revit.DB Namespace

#### ActualElectricalLoadLabel Property

---

|  |
| --- |
| ElectricalLoadClassification Class   See Also |

The name template for the actual load parameter on the load classification.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string ActualElectricalLoadLabel { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ActualElectricalLoadLabel As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ActualElectricalLoadLabel { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: actualElectricalLoadLabel is not a valid globalization format string. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ElectricalLoadClassification Class

Autodesk.Revit.DB.Electrical Namespace

#### CmCaret3 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol cm^3, indicating unit Cubic centimeters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CmCaret3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CmCaret3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CmCaret3 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### MNDashM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol MN-m, indicating unit Meganewton meters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MNDashM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MNDashM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MNDashM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### RvtLevelOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Map Levels..."

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RvtLevelOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RvtLevelOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RvtLevelOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InaccurateWall Property

---

|  |
| --- |
| BuiltInFailures InaccurateFailures Class   See Also |

Wall is slightly off axis and may cause inaccuracies.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InaccurateWall { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InaccurateWall As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InaccurateWall { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InaccurateFailures Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| Polyloop Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

Polyloop Class

Autodesk.Revit.DB.Analysis Namespace

#### AddItems Method

---

|  |
| --- |
| ComboBox Class   See Also |

Adds a new items to the ComboBox.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public IList<ComboBoxMember> AddItems( 	IList<ComboBoxMemberData> memberData ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddItems ( _ 	memberData As IList(Of ComboBoxMemberData) _ ) As IList(Of ComboBoxMember) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ComboBoxMember^>^ AddItems( 	IList<ComboBoxMemberData^>^ memberData ) ``` |

#### Parameters

memberData
:   Type:  System.Collections.Generic IList   ComboBoxMemberData
     An object list containing the data needed to construct the ComboBoxMember.

#### Return Value

The newly added ComboBoxMembers.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when memberData is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when button with memberData.Name already exists in the drop-down list. |

# See Also

ComboBox Class

Autodesk.Revit.UI Namespace

#### LoadFamily Method (String)

---

|  |
| --- |
| Document Class   See Also |

Loads an entire family and all its types/symbols into the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool LoadFamily( 	string filename ) ``` |

| Visual Basic |
| --- |
| ``` Public Function LoadFamily ( _ 	filename As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool LoadFamily( 	String^ filename ) ``` |

#### Parameters

filename
:   Type:  System String
     The fully qualified filename of the Family file, usually ending in .rfa.

#### Return Value

True if the entire family was loaded successfully into the project, otherwise False.

# Remarks

Loading an entire family may take a considerable amount of time and memory. It is recommended that you use one of the LoadFamilySymbol() methods and only load those symbols that you need.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when filename is    a null reference (  Nothing  in Visual Basic)  or empty. |

# See Also

Document Class

LoadFamily Overload

Autodesk.Revit.DB Namespace

#### VolumeCut Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cut"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId VolumeCut { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property VolumeCut As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ VolumeCut { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CurrentUsersDataFolderPath Property

---

|  |
| --- |
| ControlledApplication Class   See Also |

Path to data folder for the current user.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public string CurrentUsersDataFolderPath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CurrentUsersDataFolderPath As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ CurrentUsersDataFolderPath { 	String^ get (); } ``` |

# Remarks

Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### DeleteWorksetSettings Constructor (DeleteWorksetOption, WorksetId)

---

|  |
| --- |
| DeleteWorksetSettings Class   See Also |

Constructs a DeleteWorksetSettings object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public DeleteWorksetSettings( 	DeleteWorksetOption deleteWorksetOption, 	WorksetId elementsMoveInto ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	deleteWorksetOption As DeleteWorksetOption, _ 	elementsMoveInto As WorksetId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: DeleteWorksetSettings( 	DeleteWorksetOption deleteWorksetOption,  	WorksetId^ elementsMoveInto ) ``` |

#### Parameters

deleteWorksetOption
:   Type:  Autodesk.Revit.DB DeleteWorksetOption

elementsMoveInto
:   Type:  Autodesk.Revit.DB WorksetId

# Remarks

elementsMoveInto only takes effect when DeleteWorksetOption::Enum is MoveElementsToWorkset.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DeleteWorksetSettings Class

DeleteWorksetSettings Overload

Autodesk.Revit.DB Namespace

#### HideGridsOnLevel Method

---

|  |
| --- |
| View3D Class   See Also |

This method hides the grid lines in this 3D view on the given Level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void HideGridsOnLevel( 	ElementId levelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub HideGridsOnLevel ( _ 	levelId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void HideGridsOnLevel( 	ElementId^ levelId ) ``` |

#### Parameters

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the Level where grids will not be displayed.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View3D Class

Autodesk.Revit.DB Namespace

#### UseStripedRowsOnSheets Property

---

|  |
| --- |
| ViewSchedule Class   See Also |

Indicates whether a property setting of true will also change the display of this schedule to show striped rows on a sheet. If true, setting that property to true will also change the display. If false, striped rows will not display for this schedule on a sheet no matter what value is set for HasStripedRows.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public bool UseStripedRowsOnSheets { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UseStripedRowsOnSheets As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool UseStripedRowsOnSheets { 	bool get (); 	void set (bool value); } ``` |

# Remarks

Striped rows on sheets can be overidden by shading or conditional formatting.

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### ViewSolarstudyAnimationSpeedText Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Loop animation speed"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewSolarstudyAnimationSpeedText { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewSolarstudyAnimationSpeedText As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewSolarstudyAnimationSpeedText { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NewFamilyInstance Method (XYZ, FamilySymbol, StructuralType)

---

|  |
| --- |
| ItemFactoryBase Class   See Also |

Inserts a new instance of a family into the document, using a location and a type/symbol.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public FamilyInstance NewFamilyInstance( 	XYZ location, 	FamilySymbol symbol, 	StructuralType structuralType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFamilyInstance ( _ 	location As XYZ, _ 	symbol As FamilySymbol, _ 	structuralType As StructuralType _ ) As FamilyInstance ``` |

| Visual C++ |
| --- |
| ``` public: FamilyInstance^ NewFamilyInstance( 	XYZ^ location,  	FamilySymbol^ symbol,  	StructuralType structuralType ) ``` |

#### Parameters

location
:   Type:  Autodesk.Revit.DB XYZ
     The physical location where the instance is to be placed.

symbol
:   Type:  Autodesk.Revit.DB FamilySymbol
     A FamilySymbol object that represents the type of the instance that is to be inserted.

structuralType
:   Type:  Autodesk.Revit.DB.Structure StructuralType
     If structural then specify the type of the component.

#### Return Value

A valid instance of the given family if the creation is successful. An exception will be thrown otherwise.

# Remarks

Use this method to insert a family instance that does not require a host element or level. For creating instances of level-based families use one of the NewFamilyInstance methods of the Revit.Creation.Document class.

The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.

Some Families, such as Beams, have more than one endpoint and are inserted in the same manner as single point instances. Once inserted these linear family instances can have their endpoints changed by using the instance's Element.Location property.

Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the symbol is not active. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the family is level-based, for new instances of such families require a valid level to be supplied at the time of creation. |

# See Also

ItemFactoryBase Class

NewFamilyInstance Overload

Autodesk.Revit.Creation Namespace

#### Dispose Method

---

|  |
| --- |
| AnalysisResultSchema Class   See Also |

Releases all resources used by the  AnalysisResultSchema

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace

#### ServiceId Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The fabrication part service identifier. The service can only be changed to compatible services.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2016 Subscription Release

# Syntax

| C# |
| --- |
| ``` public int ServiceId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ServiceId As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int ServiceId { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### CacheSize Property

---

|  |
| --- |
| IFCFileModelOptions Class   See Also |

The cache size of the file.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int CacheSize { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CacheSize As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int CacheSize { 	int get (); 	void set (int value); } ``` |

# See Also

IFCFileModelOptions Class

Autodesk.Revit.DB.IFC Namespace

#### GradientColor Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "Color" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string GradientColor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GradientColor As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ GradientColor { 	String^ get (); } ``` |

# Remarks

This property is a "AssetPropertyList" of type "AssetPropertyDoubleArray4d".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### PDFExportQualityType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing the options for PDF export quality.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PDFExportQualityType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PDFExportQualityType ``` |

| Visual C++ |
| --- |
| ``` public enum class PDFExportQualityType ``` |

# Members

| Member name | Description |
| --- | --- |
| DPI72 |  |
| DPI144 |  |
| DPI300 |  |
| DPI600 |  |
| DPI1200 |  |
| DPI2400 |  |
| DPI3600 |  |
| DPI4000 |  |

# See Also

Autodesk.Revit.DB Namespace

#### StairIncompleteFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Stair element is incomplete, not all components are logic connected.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StairIncompleteFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairIncompleteFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StairIncompleteFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### CannotCopyIncompleteElement Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't copy part of element

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyIncompleteElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyIncompleteElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyIncompleteElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### IsOffsetLengthRequired Method

---

|  |
| --- |
| RebarHookType Class   See Also |

Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsOffsetLengthRequired() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsOffsetLengthRequired As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsOffsetLengthRequired() ``` |

# See Also

RebarHookType Class

Autodesk.Revit.DB.Structure Namespace

#### Delete Method

---

|  |
| --- |
| IFCAggregate Class   See Also |

Delete the aggregate object from the IFCFile model.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void Delete() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Delete ``` |

| Visual C++ |
| --- |
| ``` public: void Delete() ``` |

# See Also

IFCAggregate Class

Autodesk.Revit.DB.IFC Namespace

#### ViewAnalysisResultsVisibility Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Analysis Display Settings"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewAnalysisResultsVisibility { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewAnalysisResultsVisibility As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewAnalysisResultsVisibility { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CircularDependencyAssocProp Property

---

|  |
| --- |
| BuiltInFailures RegenFailures Class   See Also |

There is a circular dependency between a Line created with Pick Support and the supporting member.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CircularDependencyAssocProp { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CircularDependencyAssocProp As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CircularDependencyAssocProp { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RegenFailures Class

Autodesk.Revit.DB Namespace

#### LoadCategoryName Property

---

|  |
| --- |
| LoadBase Class   See Also |

The name of the category to which this load belongs.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string LoadCategoryName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LoadCategoryName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ LoadCategoryName { 	String^ get (); } ``` |

# See Also

LoadBase Class

Autodesk.Revit.DB.Structure Namespace

#### GetFloorOrSlabConstructionType Method

---

|  |
| --- |
| ConceptualConstructionType Class   See Also |

Get a Floor or Slab ConceptualConstructionType by its ConceptualConstructionFloorSlabType.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static ElementId GetFloorOrSlabConstructionType( 	Document ccda, 	ConceptualConstructionFloorSlabType typeEnum ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetFloorOrSlabConstructionType ( _ 	ccda As Document, _ 	typeEnum As ConceptualConstructionFloorSlabType _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ GetFloorOrSlabConstructionType( 	Document^ ccda,  	ConceptualConstructionFloorSlabType typeEnum ) ``` |

#### Parameters

ccda
:   Type:  Autodesk.Revit.DB Document
     The Document.

typeEnum
:   Type:  Autodesk.Revit.DB.Analysis ConceptualConstructionFloorSlabType
     The ConceptualConstructionFloorSlabType to get the ConceptualConstructionType for.

#### Return Value

Returns ElementId of a ConceptualConstructionType.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The enum is invalid for ConceptualConstructionFloorSlabType. -or- A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace

#### SpotElevIndTypeTop Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Indicator as Prefix/Suffix"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpotElevIndTypeTop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotElevIndTypeTop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpotElevIndTypeTop { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MarginType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all Margin types of Print Setting.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MarginType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MarginType ``` |

| Visual C++ |
| --- |
| ``` public enum class MarginType ``` |

# Members

| Member name | Description |
| --- | --- |
| NoMargin | The type of Margin is No Margin. |
| PrinterLimit | The type of Margin is Printer Limit. |
| UserDefined | The type of Margin is User Defined. |

# See Also

Autodesk.Revit.DB Namespace

#### SetProjectionLinePatternId Method

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

Sets the ElementId of the projection surface line pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public OverrideGraphicSettings SetProjectionLinePatternId( 	ElementId linePatternId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetProjectionLinePatternId ( _ 	linePatternId As ElementId _ ) As OverrideGraphicSettings ``` |

| Visual C++ |
| --- |
| ``` public: OverrideGraphicSettings^ SetProjectionLinePatternId( 	ElementId^ linePatternId ) ``` |

#### Parameters

linePatternId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of the projection surface line pattern for the override. InvalidElementId means no override is set.

#### Return Value

Reference to the changed object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### GetEnumerator Method

---

|  |
| --- |
| ModelCurveArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator^ GetEnumerator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

#### Implements

 IEnumerable GetEnumerator

# See Also

ModelCurveArray Class

Autodesk.Revit.DB Namespace

#### UVPoint Property

---

|  |
| --- |
| IntersectionResult Class   See Also |

2d (or two 1d) parameters of the point of intersection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public UV UVPoint { get; internal set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UVPoint As UV 	Get 	Friend Set ``` |

| Visual C++ |
| --- |
| ``` public: property UV^ UVPoint { 	UV^ get (); 	internal: void set (UV^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

# See Also

IntersectionResult Class

Autodesk.Revit.DB Namespace

#### JPerK Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol J/K, indicating unit Joules per Kelvin.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId JPerK { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property JPerK As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ JPerK { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### ElementIdParameterValue Constructor

---

|  |
| --- |
| ElementIdParameterValue Class   See Also |

Default constructor

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public ElementIdParameterValue() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ElementIdParameterValue() ``` |

# See Also

ElementIdParameterValue Class

ElementIdParameterValue Overload

Autodesk.Revit.DB Namespace

#### GetFlow Method

---

|  |
| --- |
| MEPAnalyticalConnection Class   See Also |

Gets the flow value of this analytical connection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double GetFlow() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFlow As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetFlow() ``` |

#### Return Value

The flow value.

# Remarks

If the network flow is asynchronously calculated, this method would wait until the calculation is completed. This ensures the returned flow value is always up to date.

# See Also

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ViewDisplayBackground Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ViewDisplayBackground Class

Autodesk.Revit.DB Namespace

#### ReloadConfiguration Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Reloads the fabrication configuration from its source fabrication configuration.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ConfigurationReloadInfo ReloadConfiguration() ``` |

| Visual Basic |
| --- |
| ``` Public Function ReloadConfiguration As ConfigurationReloadInfo ``` |

| Visual C++ |
| --- |
| ``` public: ConfigurationReloadInfo^ ReloadConfiguration() ``` |

#### Return Value

The information about the reload of the fabrication configuration.

# Remarks

The configuration must be reloaded from its source fabrication configuration before loading new fabrication services or additional parts.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The fabrication configuration is not set yet. -or- The source fabrication configuration could not be found. -or- this operation failed. |

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, Curve, ElementId, Boolean)

---

|  |
| --- |
| Wall Class   Example   See Also |

Creates a new rectangular profile wall within the project using the default wall style.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static Wall Create( 	Document document, 	Curve curve, 	ElementId levelId, 	bool structural ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	curve As Curve, _ 	levelId As ElementId, _ 	structural As Boolean _ ) As Wall ``` |

| Visual C++ |
| --- |
| ``` public: static Wall^ Create( 	Document^ document,  	Curve^ curve,  	ElementId^ levelId,  	bool structural ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which the new wall is created.

curve
:   Type:  Autodesk.Revit.DB Curve
     A curve representing the base line of the wall.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the level on which the wall is to be placed.

structural
:   Type:  System Boolean
     If set, specifies that the wall is structural in nature.

#### Return Value

If successful a new wall object within the project.

# Examples

 Copy  C#

```
public Wall CreateWallUsingCurve1(Autodesk.Revit.DB.Document document, Level level)
{
    // Build a location line for the wall creation
    XYZ start = new XYZ(0, 0, 0);
    XYZ end = new XYZ(10, 10, 0);
    Line geomLine = Line.CreateBound(start, end);

    // Create a wall using the location line
    return Wall.Create(document, geomLine, level.Id, true);
}
```

 Copy  VB.NET

```
Public Function CreateWallUsingCurve1(document As Autodesk.Revit.DB.Document, level As Level) As Wall
    ' Build a location line for the wall creation
    Dim start As New XYZ(0, 0, 0)
    Dim [end] As New XYZ(10, 10, 0)
    Dim geomLine As Line = Line.CreateBound(start, [end])

    ' Create a wall using the location line
    Return Wall.Create(document, geomLine, level.Id, True)
End Function
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The curve argument is not valid for wall creation. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

Wall Class

Create Overload

Autodesk.Revit.DB Namespace

#### HermiteSplineTangents Constructor

---

|  |
| --- |
| HermiteSplineTangents Class   See Also |

Constructs a new default instance of the class, with tangent vectors uninitialized.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public HermiteSplineTangents() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: HermiteSplineTangents() ``` |

# See Also

HermiteSplineTangents Class

Autodesk.Revit.DB Namespace

#### GetEnumerator Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<Curve> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of Curve) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<Curve^>^ GetEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable T GetEnumerator

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### TextureScaleLock Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "Scale Lock" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureScaleLock { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureScaleLock As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureScaleLock { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### BuiltInFailures.AutoJoinFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about AutoJoin.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class AutoJoinFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class AutoJoinFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class AutoJoinFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures AutoJoinFailures

# See Also

BuiltInFailures AutoJoinFailures Members

Autodesk.Revit.DB Namespace

#### RbsFpSprinklerOrificeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Orifice"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsFpSprinklerOrificeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsFpSprinklerOrificeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsFpSprinklerOrificeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TagHeadPosition Property

---

|  |
| --- |
| SpatialElementTag Class   See Also |

The position of the tag's head.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public XYZ TagHeadPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TagHeadPosition As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ TagHeadPosition { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

Returns the end point of the tag leader. Leader end point must be located inside of a room, space or an area. Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: Head position of the tag with no leader could not be located outside of the host element. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: SpatialElementTag is pinned. -or- When setting this property: SpatialElementTag is orphaned. |

# See Also

SpatialElementTag Class

Autodesk.Revit.DB Namespace

#### ShowElements Method (ElementId)

---

|  |
| --- |
| UIDocument Class   See Also |

Shows the element by zoom to fit.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void ShowElements( 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ShowElements ( _ 	elementId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ShowElements( 	ElementId^ elementId ) ``` |

#### Parameters

elementId
:   Type:  Autodesk.Revit.DB ElementId
     Element id that will be shown.

# Remarks

Places the element in the center of screen by moving the view.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Element id is not valid. |

# See Also

UIDocument Class

ShowElements Overload

Autodesk.Revit.UI Namespace

#### ScheduleSortGroupField Constructor

---

|  |
| --- |
| ScheduleSortGroupField Class   See Also |

Creates a new ScheduleSortGroupField.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ScheduleSortGroupField() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ScheduleSortGroupField() ``` |

# See Also

ScheduleSortGroupField Class

ScheduleSortGroupField Overload

Autodesk.Revit.DB Namespace

#### PastePartsWithInvalidService Property

---

|  |
| --- |
| BuiltInFailures SystemsFailures Class   See Also |

Parts were not pasted because fabrication configuration is not available or service is not valid in the type properties for the system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PastePartsWithInvalidService { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PastePartsWithInvalidService As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PastePartsWithInvalidService { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SystemsFailures Class

Autodesk.Revit.DB Namespace

#### DocumentSaving Event

---

|  |
| --- |
| ControlledApplication Class   See Also |

Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentSavingEventArgs> DocumentSaving ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentSaving As EventHandler(Of DocumentSavingEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentSavingEventArgs^>^ DocumentSaving { 	void add (EventHandler<DocumentSavingEventArgs^>^ value); 	void remove (EventHandler<DocumentSavingEventArgs^>^ value); } ``` |

# Remarks

This event is raised when Revit is just about to save the document. Note that the first save of a newly created document will raise  DocumentSavingAs  rather than the DocumentSaving event.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

This event is cancellable, except when it is raised during close of the application. Check the 'Cancellable' property of event's argument to see whether it is cancellable or not. When it is cancellable, call the 'Cancel()' method of event's argument to cancel it. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

Another event  DocumentSaved  will be raised immediately after the document has been saved.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### Clear Method

---

|  |
| --- |
| PhaseArray Class   See Also |

Removes every phase from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

PhaseArray Class

Autodesk.Revit.DB Namespace

#### GridBubbleLinePen Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bubble Weight Number\n"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GridBubbleLinePen { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GridBubbleLinePen As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GridBubbleLinePen { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetAllUsedServices Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public IList<FabricationService> GetAllUsedServices() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAllUsedServices As IList(Of FabricationService) ``` |

| Visual C++ |
| --- |
| ``` public: IList<FabricationService^>^ GetAllUsedServices() ``` |

#### Return Value

All the used fabrication services.

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### AirSystemData Class

---

|  |
| --- |
| Members   See Also |

Represents the data and parameter of analytical air system.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public class AirSystemData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class AirSystemData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class AirSystemData : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Mechanical AirSystemData

# See Also

AirSystemData Members

Autodesk.Revit.DB.Mechanical Namespace

#### FindAllEdgeEndPointsAtVertex Method

---

|  |
| --- |
| SolidUtils Class   See Also |

Find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static IList<EdgeEndPoint> FindAllEdgeEndPointsAtVertex( 	EdgeEndPoint edgeEndPoint ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function FindAllEdgeEndPointsAtVertex ( _ 	edgeEndPoint As EdgeEndPoint _ ) As IList(Of EdgeEndPoint) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<EdgeEndPoint^>^ FindAllEdgeEndPointsAtVertex( 	EdgeEndPoint^ edgeEndPoint ) ``` |

#### Parameters

edgeEndPoint
:   Type:  Autodesk.Revit.DB EdgeEndPoint
     The input EdgeEndPoint that identifies the vertex.

#### Return Value

All EdgeEndPoints at the vertex. The input EdgeEndPoint is also included.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint. |

# See Also

SolidUtils Class

Autodesk.Revit.DB Namespace

#### GetValue Method

---

|  |
| --- |
| AssetPropertyList Class   See Also |

Gets a collection of properties stored in this property list. These properties are copied.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<AssetProperty> GetValue() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetValue As IList(Of AssetProperty) ``` |

| Visual C++ |
| --- |
| ``` public: IList<AssetProperty^>^ GetValue() ``` |

#### Return Value

Returns a copy of all the properties in this AssetPropertyList.

# Remarks

All the properties in the list are of the same AssetPropertyType. The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.

# See Also

AssetPropertyList Class

Autodesk.Revit.DB.Visual Namespace

#### Create Method (Document, Element, IList(CurveLoop), XYZ, XYZ, ElementId, ElementId)

---

|  |
| --- |
| FabricArea Class   See Also |

Creates a FabricArea from an array of curves.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static FabricArea Create( 	Document aDoc, 	Element hostElement, 	IList<CurveLoop> curveLoops, 	XYZ majorDirection, 	XYZ majorDirectionOrigin, 	ElementId fabricAreaTypeId, 	ElementId fabricSheetTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDoc As Document, _ 	hostElement As Element, _ 	curveLoops As IList(Of CurveLoop), _ 	majorDirection As XYZ, _ 	majorDirectionOrigin As XYZ, _ 	fabricAreaTypeId As ElementId, _ 	fabricSheetTypeId As ElementId _ ) As FabricArea ``` |

| Visual C++ |
| --- |
| ``` public: static FabricArea^ Create( 	Document^ aDoc,  	Element^ hostElement,  	IList<CurveLoop^>^ curveLoops,  	XYZ^ majorDirection,  	XYZ^ majorDirectionOrigin,  	ElementId^ fabricAreaTypeId,  	ElementId^ fabricSheetTypeId ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     The document.

hostElement
:   Type:  Autodesk.Revit.DB Element
     The element that will host the FabricArea. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.

curveLoops
:   Type:  System.Collections.Generic IList   CurveLoop
     An array of curves that will define the outline of the FabricArea. This includes curves defining openings in the interior of the area.

majorDirection
:   Type:  Autodesk.Revit.DB XYZ
     A vector to define the major direction of the FabricArea.

majorDirectionOrigin
:   Type:  Autodesk.Revit.DB XYZ
     An origin point of the major direction line

fabricAreaTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the FabricAreaType.

fabricSheetTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the FabricSheetType.

#### Return Value

The newly created FabricArea.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Not all curveLoops in curveLoops are closed and continuous. -or- Not all curveLoops in curveLoops are in the same plane. -or- curveLoops should only contain lines or arcs. -or- The element hostElement was not found in the given document. -or- the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet. -or- fabricAreaTypeId should refer to an FabricAreaType element. -or- fabricSheetTypeId should refer to an FabricSheetType element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | majorDirection has zero length. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

FabricArea Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### GetLinkLoadResult Method

---

|  |
| --- |
| LinkLoadResult Class   See Also |

Searches this LinkLoadResult and all nested LinkLoadResults for the load operation results of a specified ExternalResourceReference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public LinkLoadResult GetLinkLoadResult( 	ExternalResourceReference matchExtResRef ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLinkLoadResult ( _ 	matchExtResRef As ExternalResourceReference _ ) As LinkLoadResult ``` |

| Visual C++ |
| --- |
| ``` public: LinkLoadResult^ GetLinkLoadResult( 	ExternalResourceReference^ matchExtResRef ) ``` |

#### Parameters

matchExtResRef
:   Type:  Autodesk.Revit.DB ExternalResourceReference
     An ExternalResourceReference whose LinkLoadResults are contained in this object.

#### Return Value

A LinkLoadResult object with the load results for the specified ExternalResourceReference.

# Remarks

In the case where there are multiple matches, then the LinkLoadResult closest to the top-level link will be returned. For example, if you are searching for C, starting with a top-level link, A, which links B and C, while B also links C directly, then the load results for C as a direct sub-link of A will be returned. It is expected that the LinkLoadResults for all instances of C in the nested load result tree will be the same. However, if you need to inspect each individual result, the LinkLoadResult class does provide methods to navigate the tree.

NULL is returned if a match for the ExternalResourceReference cannot be found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

LinkLoadResult Class

Autodesk.Revit.DB Namespace

#### UsedInSizeLists Property

---

|  |
| --- |
| ConduitSize Class   See Also |

Whether it is used in size lists.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool UsedInSizeLists { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property UsedInSizeLists As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool UsedInSizeLists { 	bool get (); } ``` |

# See Also

ConduitSize Class

Autodesk.Revit.DB.Electrical Namespace

#### Title Property

---

|  |
| --- |
| ColorFillScheme Class   See Also |

Represents the title displayed in  ColorFillLegend  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public string Title { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Title As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Title { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ColorFillScheme Class

Autodesk.Revit.DB Namespace

#### GetWallBaseOffset Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Obtains the base offset of the wall.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static double GetWallBaseOffset( 	Wall wall ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetWallBaseOffset ( _ 	wall As Wall _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: static double GetWallBaseOffset( 	Wall^ wall ) ``` |

#### Parameters

wall
:   Type:  Autodesk.Revit.DB Wall
     The wall.

#### Return Value

The base offset of the wall.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### DeltaDegreeR Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol deltaÂ°R, indicating unit Rankine interval.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DeltaDegreeR { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DeltaDegreeR As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DeltaDegreeR { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### CanSetValue Method (Double)

---

|  |
| --- |
| ColorFillSchemeEntry Class   See Also |

Checks whether  StorageType  of entry is Double and the value is no less than 0.0.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool CanSetValue( 	double value ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanSetValue ( _ 	value As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanSetValue( 	double value ) ``` |

#### Parameters

value
:   Type:  System Double
     New Double value.

#### Return Value

True if  StorageType  of the entry is Double and the value is finite, false otherwise.

# See Also

ColorFillSchemeEntry Class

CanSetValue Overload

Autodesk.Revit.DB Namespace

#### GetAbsolutePath Method

---

|  |
| --- |
| ExternalFileReference Class   See Also |

Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ModelPath GetAbsolutePath() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAbsolutePath As ModelPath ``` |

| Visual C++ |
| --- |
| ``` public: ModelPath^ GetAbsolutePath() ``` |

#### Return Value

A full path to the linked model.

# Remarks

ExternalFileReferences which are taken from a closed document will report their absolute path as of the last time the document was saved.

# See Also

ExternalFileReference Class

Autodesk.Revit.DB Namespace

#### BoltDiameter Property

---

|  |
| --- |
| StructuralSectionIWideFlange Class   See Also |

Maximum bolt hole diameter, in. (mm)

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double BoltDiameter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BoltDiameter As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BoltDiameter { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionIWideFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### SheetScale Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Scale"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SheetScale { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SheetScale As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SheetScale { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Equality Operator

---

|  |
| --- |
| SchedulableField Class   See Also |

Determines whether two SchedulableField are the same.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool operator ==( 	SchedulableField first, 	SchedulableField second ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Operator = ( _ 	first As SchedulableField, _ 	second As SchedulableField _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool operator ==( 	SchedulableField^ first,  	SchedulableField^ second ) ``` |

#### Parameters

first
:   Type:  Autodesk.Revit.DB SchedulableField
     The first SchedulableField.

second
:   Type:  Autodesk.Revit.DB SchedulableField
     The second SchedulableField.

#### Return Value

True if the SchedulableField are the same, otherwise false.

# See Also

SchedulableField Class

Autodesk.Revit.DB Namespace

#### CombinableElementArray Constructor

---

|  |
| --- |
| CombinableElementArray Class   See Also |

Initializes a new instance of the  CombinableElementArray  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CombinableElementArray() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: CombinableElementArray() ``` |

# See Also

CombinableElementArray Class

Autodesk.Revit.DB Namespace

#### NoPanelsLoaded Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

No Curtain Panel Families loaded. Can't make arced Curtain Wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoPanelsLoaded { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoPanelsLoaded As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoPanelsLoaded { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### IsAcceptableFromPosition Method

---

|  |
| --- |
| SpatialElementFromToCalculationPoints Class   See Also |

Checks whether a given "from" position is valid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsAcceptableFromPosition( 	XYZ fromPosition ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsAcceptableFromPosition ( _ 	fromPosition As XYZ _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsAcceptableFromPosition( 	XYZ^ fromPosition ) ``` |

#### Parameters

fromPosition
:   Type:  Autodesk.Revit.DB XYZ

#### Return Value

True if the input is an acceptable "from" position and False otherwise.

# Remarks

The "from" position and the "to" position must be on opposite sides of the family's host. Flipping the calculation point will reverse the direction.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SpatialElementFromToCalculationPoints Class

Autodesk.Revit.DB Namespace

#### GetGraphicsStyle Method

---

|  |
| --- |
| Category Class   See Also |

Gets the graphics style associated with this category for the given graphics style type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public GraphicsStyle GetGraphicsStyle( 	GraphicsStyleType graphicsStyleType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetGraphicsStyle ( _ 	graphicsStyleType As GraphicsStyleType _ ) As GraphicsStyle ``` |

| Visual C++ |
| --- |
| ``` public: GraphicsStyle^ GetGraphicsStyle( 	GraphicsStyleType graphicsStyleType ) ``` |

#### Parameters

graphicsStyleType
:   Type:  Autodesk.Revit.DB GraphicsStyleType
     The type of graphics style.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-"graphicsStyleType"-is out of range. |

# See Also

Category Class

Autodesk.Revit.DB Namespace

#### RoomCalculationPoint Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Room Calculation Point"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomCalculationPoint { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomCalculationPoint As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomCalculationPoint { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AddBuilding Method

---

|  |
| --- |
| IFCProductWrapper Class   See Also |

Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void AddBuilding( 	IFCAnyHandle buildingHandle ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddBuilding ( _ 	buildingHandle As IFCAnyHandle _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddBuilding( 	IFCAnyHandle^ buildingHandle ) ``` |

#### Parameters

buildingHandle
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The IfcBuilding handle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace

#### OrganizationDescription Property

---

|  |
| --- |
| ProjectInfo Class   See Also |

Get or Set the Organization Description of the Project Information.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string OrganizationDescription { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property OrganizationDescription As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ OrganizationDescription { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

This property is used to get or set the Project Number of the Project Information.

# See Also

ProjectInfo Class

Autodesk.Revit.DB Namespace

#### SourceDocument Property

---

|  |
| --- |
| TransferredProjectStandardsEventArgs Class   See Also |

Source document.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017.2

# Syntax

| C# |
| --- |
| ``` public Document SourceDocument { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SourceDocument As Document 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Document^ SourceDocument { 	Document^ get (); } ``` |

# See Also

TransferredProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### SetFlowConvertionServerInfo Method

---

|  |
| --- |
| PipeSettings Class   See Also |

Set the MEPServerInfo of the current plumbing flow convertion server.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetFlowConvertionServerInfo( 	MEPCalculationServerInfo serverInfo ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFlowConvertionServerInfo ( _ 	serverInfo As MEPCalculationServerInfo _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFlowConvertionServerInfo( 	MEPCalculationServerInfo^ serverInfo ) ``` |

#### Parameters

serverInfo
:   Type:  Autodesk.Revit.DB MEPCalculationServerInfo

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace

#### NewXYZ Method (Double, Double, Double)

---

|  |
| --- |
| Application Class   See Also |

Creates a XYZ object representing coordinates in 3-space with supplied values.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ NewXYZ( 	double x, 	double y, 	double z ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewXYZ ( _ 	x As Double, _ 	y As Double, _ 	z As Double _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ NewXYZ( 	double x,  	double y,  	double z ) ``` |

#### Parameters

x
:   Type:  System Double
     The first coordinate.

y
:   Type:  System Double
     The second coordinate.

z
:   Type:  System Double
     The third coordinate.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when setting an infinite number to the X, Y or Z property. |

# See Also

Application Class

NewXYZ Overload

Autodesk.Revit.Creation Namespace

#### SetSurfaceBackgroundPatternVisible Method

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

Sets the visibility of the surface background fill pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public OverrideGraphicSettings SetSurfaceBackgroundPatternVisible( 	bool fillPatternVisible ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetSurfaceBackgroundPatternVisible ( _ 	fillPatternVisible As Boolean _ ) As OverrideGraphicSettings ``` |

| Visual C++ |
| --- |
| ``` public: OverrideGraphicSettings^ SetSurfaceBackgroundPatternVisible( 	bool fillPatternVisible ) ``` |

#### Parameters

fillPatternVisible
:   Type:  System Boolean
     Value of the visibility of the surface background fill pattern.

#### Return Value

Reference to the changed object.

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### Application Property

---

|  |
| --- |
| ExternalCommandData Class   See Also |

Retrieves an object that represents the current Application for external command.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public UIApplication Application { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Application As UIApplication 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property UIApplication^ Application { 	UIApplication^ get (); 	void set (UIApplication^ value); } ``` |

# See Also

ExternalCommandData Class

Autodesk.Revit.UI Namespace

#### IsFaceReference Method

---

|  |
| --- |
| Form Class   See Also |

Tell if the pick is the reference to a face of the form.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsFaceReference( 	Reference faceReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsFaceReference ( _ 	faceReference As Reference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsFaceReference( 	Reference^ faceReference ) ``` |

#### Parameters

faceReference
:   Type:  Autodesk.Revit.DB Reference
     Reference to be checked.

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType, ElementId)

---

|  |
| --- |
| ScheduleFilter Class   See Also |

Creates a new ScheduleFilter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ScheduleFilter( 	ScheduleFieldId fieldId, 	ScheduleFilterType filterType, 	ElementId value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	fieldId As ScheduleFieldId, _ 	filterType As ScheduleFilterType, _ 	value As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ScheduleFilter( 	ScheduleFieldId^ fieldId,  	ScheduleFilterType filterType,  	ElementId^ value ) ``` |

#### Parameters

fieldId
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The ID of the field used to filter the schedule.

filterType
:   Type:  Autodesk.Revit.DB ScheduleFilterType
     The filter type.

value
:   Type:  Autodesk.Revit.DB ElementId
     The filter value for a filter using an ElementId value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ScheduleFilter Class

ScheduleFilter Overload

Autodesk.Revit.DB Namespace

#### UndersideSurfaceStyle Property

---

|  |
| --- |
| StairsRunType Class   See Also |

The underside surface style of the stairs run, only available for monolithic stairs run.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public StairsUndersideSurfaceStyle UndersideSurfaceStyle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UndersideSurfaceStyle As StairsUndersideSurfaceStyle 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property StairsUndersideSurfaceStyle UndersideSurfaceStyle { 	StairsUndersideSurfaceStyle get (); 	void set (StairsUndersideSurfaceStyle value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable. |

# See Also

StairsRunType Class

Autodesk.Revit.DB.Architecture Namespace

#### Reset Method

---

|  |
| --- |
| DefinitionBindingMapIterator Class   See Also |

Bring the iterator back to the start of the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the map in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

DefinitionBindingMapIterator Class

Autodesk.Revit.DB Namespace

#### EnableDepthCueing Property

---

|  |
| --- |
| ViewDisplayDepthCueing Class   See Also |

True to enable depth cueing. False to disable it.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool EnableDepthCueing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property EnableDepthCueing As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool EnableDepthCueing { 	bool get (); 	void set (bool value); } ``` |

# See Also

ViewDisplayDepthCueing Class

Autodesk.Revit.DB Namespace

#### KgfPerMSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kgf/mÂ², indicating unit Kilograms force per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KgfPerMSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KgfPerMSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KgfPerMSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### SecondaryEnd Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Secondary End"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SecondaryEnd { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SecondaryEnd As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SecondaryEnd { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| BRepBuilderEdgeGeometry Class   See Also |

Releases all resources used by the  BRepBuilderEdgeGeometry

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

BRepBuilderEdgeGeometry Class

Autodesk.Revit.DB Namespace

#### GridLineWeight Property

---

|  |
| --- |
| AnalysisDisplayDeformedShapeSettings Class   See Also |

Line weight of grid lines.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int GridLineWeight { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property GridLineWeight As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int GridLineWeight { 	int get (); 	void set (int value); } ``` |

# See Also

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### CannotCutRefPlane Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Can't cut reference plane.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCutRefPlane { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCutRefPlane As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCutRefPlane { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### BasicLossFactor Class

---

|  |
| --- |
| Members   See Also |

This class encapsulates basic lighting loss factor calculation.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class BasicLossFactor : LossFactor ``` |

| Visual Basic |
| --- |
| ``` Public Class BasicLossFactor _ 	Inherits LossFactor ``` |

| Visual C++ |
| --- |
| ``` public ref class BasicLossFactor : public LossFactor ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Lighting LossFactor
  Autodesk.Revit.DB.Lighting BasicLossFactor

# See Also

BasicLossFactor Members

Autodesk.Revit.DB.Lighting Namespace

#### StairsAttrTreadFrontProfile Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Nosing Profile"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrTreadFrontProfile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrTreadFrontProfile As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrTreadFrontProfile { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotCutInstanceOutError Property

---

|  |
| --- |
| BuiltInFailures CutFailures Class   See Also |

Can't cut instance of [Symbol] out of Wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCutInstanceOutError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCutInstanceOutError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCutInstanceOutError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CutFailures Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| PaperSourceSet Class   See Also |

Returns the number of objects that are in the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

PaperSourceSet Class

Autodesk.Revit.DB Namespace

#### BoltDiameterLongerFlange Property

---

|  |
| --- |
| StructuralSectionLAngle Class   See Also |

Maximum bolt hole diameter in the longer flange, in. (mm)

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double BoltDiameterLongerFlange { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BoltDiameterLongerFlange As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BoltDiameterLongerFlange { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionLAngle Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### Railing Class

---

|  |
| --- |
| Members   See Also |

Represents a railing element in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class Railing : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class Railing _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class Railing : public Element ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Architecture Railing

# See Also

Railing Members

Autodesk.Revit.DB.Architecture Namespace

#### GetElementIds Method

---

|  |
| --- |
| Selection Class   See Also |

Returns the ids of the elements that are currently selected within the project. The selection may not be complete. See  GetReferences  for more options.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetElementIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetElementIds As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetElementIds() ``` |

#### Return Value

The collection containing the ids of the selected elements.

# See Also

Selection Class

Autodesk.Revit.UI.Selection Namespace

#### DimLineExtension Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Dimension Line Extension"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLineExtension { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLineExtension As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLineExtension { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BarNominalDiameter Property

---

|  |
| --- |
| RebarBendData Class   See Also |

Defines the nominal diameter of the bar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double BarNominalDiameter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BarNominalDiameter As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BarNominalDiameter { 	double get (); 	void set (double value); } ``` |

# See Also

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace

#### KeynoteOnLinkWithDifferentKeynoteFile Property

---

|  |
| --- |
| BuiltInFailures KeynoteTagFailures Class   See Also |

The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId KeynoteOnLinkWithDifferentKeynoteFile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KeynoteOnLinkWithDifferentKeynoteFile As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ KeynoteOnLinkWithDifferentKeynoteFile { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures KeynoteTagFailures Class

Autodesk.Revit.DB Namespace

#### FilePath Class

---

|  |
| --- |
| Members   See Also |

This class represents a path on a disk or network location, but not a path to a Revit server location.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class FilePath : ModelPath ``` |

| Visual Basic |
| --- |
| ``` Public Class FilePath _ 	Inherits ModelPath ``` |

| Visual C++ |
| --- |
| ``` public ref class FilePath : public ModelPath ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ModelPath
  Autodesk.Revit.DB FilePath

# See Also

FilePath Members

Autodesk.Revit.DB Namespace

#### SteelElemPlateArea Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemPlateArea { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemPlateArea As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemPlateArea { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| SketchedStairsCurveData Class   See Also |

Releases all resources used by the  SketchedStairsCurveData

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

SketchedStairsCurveData Class

Autodesk.Revit.DB Namespace

#### SupportHandClearance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Hand Clearance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SupportHandClearance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SupportHandClearance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SupportHandClearance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarInstanceBarModelDiameter Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Model Bar Diameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarInstanceBarModelDiameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarInstanceBarModelDiameter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarInstanceBarModelDiameter { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FlexPipe Class

---

|  |
| --- |
| Members   See Also |

A flex pipe in the Autodesk Revit MEP product.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class FlexPipe : MEPCurve ``` |

| Visual Basic |
| --- |
| ``` Public Class FlexPipe _ 	Inherits MEPCurve ``` |

| Visual C++ |
| --- |
| ``` public ref class FlexPipe : public MEPCurve ``` |

# Remarks

The flex pipe is only available in the Autodesk Revit MEP product.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB HostObject
  Autodesk.Revit.DB MEPCurve
  Autodesk.Revit.DB.Plumbing FlexPipe

# See Also

FlexPipe Members

Autodesk.Revit.DB.Plumbing Namespace

#### InvalidSketch Property

---

|  |
| --- |
| BuiltInFailures GridChainSketchFailures Class   See Also |

Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidSketch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidSketch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GridChainSketchFailures Class

Autodesk.Revit.DB Namespace

#### AddListeningDimensionBendToBend Method

---

|  |
| --- |
| RebarShapeDefinitionBySegments Class   See Also |

Specify a dimension between two bends, measured by a read-only parameter.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void AddListeningDimensionBendToBend( 	ElementId paramId, 	double constraintDirCoordX, 	double constraintDirCoordY, 	int iSegment0, 	int iEnd0, 	int iSegment1, 	int iEnd1 ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddListeningDimensionBendToBend ( _ 	paramId As ElementId, _ 	constraintDirCoordX As Double, _ 	constraintDirCoordY As Double, _ 	iSegment0 As Integer, _ 	iEnd0 As Integer, _ 	iSegment1 As Integer, _ 	iEnd1 As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddListeningDimensionBendToBend( 	ElementId^ paramId,  	double constraintDirCoordX,  	double constraintDirCoordY,  	int iSegment0,  	int iEnd0,  	int iSegment1,  	int iEnd1 ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter to report the length of the dimension. The parameter will be read-only on Rebar instances.

constraintDirCoordX
:   Type:  System Double
     The x-coordinate of a 2D vector specifying the constraint direction.

constraintDirCoordY
:   Type:  System Double
     The y-coordinate of a 2D vector specifying the constraint direction.

iSegment0
:   Type:  System Int32
     Index of the first segment (0 to NumberOfSegments - 1).

iEnd0
:   Type:  System Int32
     End (0 or 1) of the first segment.

iSegment1
:   Type:  System Int32
     Index of the second segment (0 to NumberOfSegments - 1).

iEnd1
:   Type:  System Int32
     End (0 or 1) of the second segment.

# Remarks

Each reference is at the outside of the bend, perpendicular to the specified segment. So the overall length of a shape with 5 segments might be defined by calling this function with iSegment0=0, iEnd0=0, iSegment1=4, iEnd1=1.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | paramId is not the id of a shared parameter in the current document, or its unit type is not UT\_Reinforcement\_Length or UT\_Angle. -or- The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero. -or- iSegment0 is not between 0 and NumberOfSegments. -or- iEnd0 is neither 0 nor 1. -or- iSegment1 is not between 0 and NumberOfSegments. -or- iEnd1 is neither 0 nor 1. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarShapeDefinitionBySegments Class

Autodesk.Revit.DB.Structure Namespace

#### FailureMessageKey Constructor

---

|  |
| --- |
| FailureMessageKey Class   See Also |

Constructs a new FailureMessageKey with default settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureMessageKey() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: FailureMessageKey() ``` |

# See Also

FailureMessageKey Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| TemperatureRatingTypeSet Class   See Also |

Returns the number of TemperatureRating types that are in the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### IsAllowedAsDisplacedElement Method

---

|  |
| --- |
| DisplacementElement Class   See Also |

Indicates if the specified element is allowed to be displaced.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool IsAllowedAsDisplacedElement( 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsAllowedAsDisplacedElement ( _ 	element As Element _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsAllowedAsDisplacedElement( 	Element^ element ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     Any element.

#### Return Value

Returns true if the element is eligible to be assigned to a DisplacementElement.

# Remarks

Exclusions include view specific elements as well as certain categories of elements.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DisplacementElement Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| ProjectLocationSet Class   See Also |

Returns the number of project locations that are in the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

ProjectLocationSet Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.FamilyFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures related to families.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class FamilyFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class FamilyFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class FamilyFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures FamilyFailures

# See Also

BuiltInFailures FamilyFailures Members

Autodesk.Revit.DB Namespace

#### CannotCutParallelToLocationCurve Property

---

|  |
| --- |
| BuiltInFailures SlantedColumnFailures Class   See Also |

Cut plane of slanted column end is parallel to the location curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCutParallelToLocationCurve { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCutParallelToLocationCurve As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCutParallelToLocationCurve { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SlantedColumnFailures Class

Autodesk.Revit.DB Namespace

#### PatternMirrorForDivisionRule Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mirror"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PatternMirrorForDivisionRule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PatternMirrorForDivisionRule As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PatternMirrorForDivisionRule { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ExternalResourceBrowserData Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ExternalResourceBrowserData Class

Autodesk.Revit.DB Namespace

#### BoltSpacing Property

---

|  |
| --- |
| StructuralSectionIParallelFlange Class   See Also |

Standard bolt spacing, in. (mm)

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double BoltSpacing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BoltSpacing As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BoltSpacing { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionIParallelFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### OnShutdownEO Method

---

|  |
| --- |
| DocumentEntryPoint Class   See Also |

For Revit Macros internal use only.

**Namespace:**   Autodesk.Revit.UI.Macros
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void OnShutdownEO() ``` |

| Visual Basic |
| --- |
| ``` Public Sub OnShutdownEO ``` |

| Visual C++ |
| --- |
| ``` public: virtual void OnShutdownEO() sealed ``` |

#### Implements

 IEntryPoint OnShutdown

# See Also

DocumentEntryPoint Class

Autodesk.Revit.UI.Macros Namespace

#### SetFile Method

---

|  |
| --- |
| ImporterIFC Class   See Also |

Sets the handle to the IFC file being created during this import operation.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetFile( 	IFCFile file ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFile ( _ 	file As IFCFile _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFile( 	IFCFile^ file ) ``` |

#### Parameters

file
:   Type:  Autodesk.Revit.DB.IFC IFCFile
     The handle to the file.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ImporterIFC Class

Autodesk.Revit.DB.IFC Namespace

#### GetSelectedElements Method

---

|  |
| --- |
| SelectionChangedEventArgs Class   See Also |

Returns ElementIds of selected elements.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public ISet<ElementId> GetSelectedElements() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSelectedElements As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ISet<ElementId^>^ GetSelectedElements() ``` |

# See Also

SelectionChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### FabricationRodsConnectionChangedWarning Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The structural component that the hanger is attached to has changed to a different element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationRodsConnectionChangedWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationRodsConnectionChangedWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationRodsConnectionChangedWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| Schema Class   See Also |

Releases all resources used by the  Schema

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

Schema Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### Volume Property

---

|  |
| --- |
| Solid Class   See Also |

Returns the signed volume of this solid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Volume { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Volume As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Volume { 	double get (); } ``` |

#### Return Value

The real number equal to the signed volume of this solid.

# Remarks

Revit attempts to compute the volume analytically, if possible. If an analytical solution is not possible, it uses tessellated faces to calculate a reasonable approximation for the volume. The calculated volume may be slightly underestimated or overestimated if curved surfaces are present.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when this solid is not a valid Geometry object or the volume calculation failed. |

# See Also

Solid Class

Autodesk.Revit.DB Namespace

#### WorksetId Property

---

|  |
| --- |
| Element Class   See Also |

Get Id of the Workset which owns the element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public WorksetId WorksetId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property WorksetId As WorksetId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property WorksetId^ WorksetId { 	WorksetId^ get (); } ``` |

# Remarks

Each element belongs to one and only one workset.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### Thickness Property

---

|  |
| --- |
| StairsLandingType Class   See Also |

Thickness of the stairs landing.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Thickness { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Thickness As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Thickness { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for thickness must be greater than 0 and no more than 30000 feet. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The landing type doesn't have monolithic support. |

# See Also

StairsLandingType Class

Autodesk.Revit.DB.Architecture Namespace

#### PanelConnectedLabel Property

---

|  |
| --- |
| ElectricalLoadClassification Class   See Also |

The name template for the connected load parameter of the load classification.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string PanelConnectedLabel { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PanelConnectedLabel As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ PanelConnectedLabel { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: panelConnectedLabel is not a valid globalization format string. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ElectricalLoadClassification Class

Autodesk.Revit.DB.Electrical Namespace

#### KilojoulesPerKelvin Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kilojoules per Kelvin.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KilojoulesPerKelvin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KilojoulesPerKelvin As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KilojoulesPerKelvin { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### AllowLargeGeometry Enumeration

---

|  |
| --- |
| See Also |

An enumerated type containing settings information related to handling of large geometries.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum AllowLargeGeometry ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AllowLargeGeometry ``` |

| Visual C++ |
| --- |
| ``` public enum class AllowLargeGeometry ``` |

# Members

| Member name | Description |
| --- | --- |
| DisAllow | Cancel the export/path of travel creation, failing with the apporiate status. |
| Allow | Allow export/path of travel creation on large geometries. |
| Prompt | Prompt in the UI. If no UI is present, default will be DisAllow. |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### Dispose Method

---

|  |
| --- |
| ColorWithTransparency Class   See Also |

Releases all resources used by the  ColorWithTransparency

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ColorWithTransparency Class

Autodesk.Revit.DB Namespace

#### TrussFamilyDiagWeb Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Diagonal Webs"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TrussFamilyDiagWeb { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrussFamilyDiagWeb As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TrussFamilyDiagWeb { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### RbsCabletrayconduitSystemType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"System Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCabletrayconduitSystemType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCabletrayconduitSystemType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCabletrayconduitSystemType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TopSketch Property

---

|  |
| --- |
| Blend Class   See Also |

Returns the Top Sketch of the Blend.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Sketch TopSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TopSketch As Sketch 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Sketch^ TopSketch { 	Sketch^ get (); } ``` |

# Remarks

This property is used to retrieve the Top Sketch of the Blend.

# See Also

Blend Class

Autodesk.Revit.DB Namespace

#### CreateRibbonPanel Method (Tab, String)

---

|  |
| --- |
| UIApplication Class   See Also |

Create a new RibbonPanel on the designated standard Revit tab.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual RibbonPanel CreateRibbonPanel( 	Tab tab, 	string panelName ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function CreateRibbonPanel ( _ 	tab As Tab, _ 	panelName As String _ ) As RibbonPanel ``` |

| Visual C++ |
| --- |
| ``` public: virtual RibbonPanel^ CreateRibbonPanel( 	Tab tab,  	String^ panelName ) ``` |

#### Parameters

tab
:   Type:  Autodesk.Revit.UI Tab
     The target tab, on which the new panel will be created.

panelName
:   Type:  System String
     The name of the panel to be created.

# Remarks

This method will create a custom panel appending to the specified tab. This method is not supported in Macros.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | panelName is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | panelName is Empty or the tab is not valid. |
| Autodesk.Revit.Exceptions InvalidOperationException | If more than 100 panels were created or the tab cannot be found. |

# See Also

UIApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace

#### ReferenceIntersector Constructor (ICollection(ElementId), FindReferenceTarget, View3D)

---

|  |
| --- |
| ReferenceIntersector Class   See Also |

Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ReferenceIntersector( 	ICollection<ElementId> targetElementIds, 	FindReferenceTarget targetType, 	View3D view3d ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	targetElementIds As ICollection(Of ElementId), _ 	targetType As FindReferenceTarget, _ 	view3d As View3D _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ReferenceIntersector( 	ICollection<ElementId^>^ targetElementIds,  	FindReferenceTarget targetType,  	View3D^ view3d ) ``` |

#### Parameters

targetElementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The target element ids.

targetType
:   Type:  Autodesk.Revit.DB FindReferenceTarget
     The target type of references to return.

view3d
:   Type:  Autodesk.Revit.DB View3D
     The view in which to find references.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Returns true if the view is not a view template. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ReferenceIntersector Class

ReferenceIntersector Overload

Autodesk.Revit.DB Namespace

#### Lpm Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol LPM, indicating unit Liters per minute.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Lpm { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Lpm As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Lpm { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### AllowsAnalysisDisplay Method

---

|  |
| --- |
| View Class   See Also |

Identifies if this view allows display of Analysis results.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool AllowsAnalysisDisplay() ``` |

| Visual Basic |
| --- |
| ``` Public Function AllowsAnalysisDisplay As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AllowsAnalysisDisplay() ``` |

#### Return Value

True if the view allows display of Analysis results, false otherwise.

# See Also

View Class

Autodesk.Revit.DB Namespace

#### GetExtent Method

---

|  |
| --- |
| IPointCloudAccess Interface   See Also |

Implement this method to returns an object that contains the bounding box of the entire point cloud, aligned to the point cloud coordinate system.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` Outline GetExtent() ``` |

| Visual Basic |
| --- |
| ``` Function GetExtent As Outline ``` |

| Visual C++ |
| --- |
| ``` Outline^ GetExtent() ``` |

#### Return Value

The bounding box of the point cloud.

# Remarks

The extents should reflect the maximum and minimum coordinates of the stored points, and not incorporate the offset.

# See Also

IPointCloudAccess Interface

Autodesk.Revit.DB.PointClouds Namespace

#### NewReferenceArray Method

---

|  |
| --- |
| Application Class   See Also |

Creates a new instance of a reference array.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ReferenceArray NewReferenceArray() ``` |

| Visual Basic |
| --- |
| ``` Public Function NewReferenceArray As ReferenceArray ``` |

| Visual C++ |
| --- |
| ``` public: ReferenceArray^ NewReferenceArray() ``` |

# See Also

Application Class

Autodesk.Revit.Creation Namespace

#### Version Property

---

|  |
| --- |
| FabricationVersionInfo Class   See Also |

The version number of the change.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public int Version { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Version As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int Version { 	int get (); } ``` |

# See Also

FabricationVersionInfo Class

Autodesk.Revit.DB Namespace

#### JustifyType Property

---

|  |
| --- |
| LayoutRuleClearSpacing Class   See Also |

Get or set the type of justification.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public BeamSystemJustifyType JustifyType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property JustifyType As BeamSystemJustifyType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property BeamSystemJustifyType JustifyType { 	BeamSystemJustifyType get (); 	void set (BeamSystemJustifyType value); } ``` |

# Remarks

The justifyType passed in must be a valid object.

# See Also

LayoutRuleClearSpacing Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| IntegerRange Class   See Also |

Releases all resources used by the  IntegerRange

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

IntegerRange Class

Autodesk.Revit.DB Namespace

#### NumberOfConnectedProperties Property

---

|  |
| --- |
| AssetProperty Class   See Also |

The number of currently connected properties.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int NumberOfConnectedProperties { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfConnectedProperties As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfConnectedProperties { 	int get (); } ``` |

# See Also

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace

#### CanHaveSymbol Method

---

|  |
| --- |
| FormatOptions Class   See Also |

Checks whether a symbol can be specified to display the unit in this FormatOptions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool CanHaveSymbol() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanHaveSymbol As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanHaveSymbol() ``` |

#### Return Value

True if a symbol can be specified, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also

FormatOptions Class

CanHaveSymbol Overload

Autodesk.Revit.DB Namespace

#### ElementClassFilter Class

---

|  |
| --- |
| Members   Example   See Also |

A filter used to match elements by their class.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class ElementClassFilter : ElementQuickFilter ``` |

| Visual Basic |
| --- |
| ``` Public Class ElementClassFilter _ 	Inherits ElementQuickFilter ``` |

| Visual C++ |
| --- |
| ``` public ref class ElementClassFilter : public ElementQuickFilter ``` |

# Remarks

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

This filter will match elements whose class is an exact match to the input class, or elements whose class is derived from the input class.

There is a small subset of Element subclasses in the API which are not supported by this filter. These types exist in the API, but not in Revit's native object model, which means that this filter doesn't support them. In order to use a class filter to find elements of these types, it is necessary to use a higher level class and then process the results further to find elements matching only the subtype. The following types are affected by this restriction:

* Subclasses of Autodesk.Revit.DB.Material
* Subclasses of Autodesk.Revit.DB.CurveElement
* Subclasses of Autodesk.Revit.DB.ConnectorElement
* Subclasses of Autodesk.Revit.DB.HostedSweep
* Autodesk.Revit.DB.Architecture.Room
* Autodesk.Revit.DB.Mechanical.Space
* Autodesk.Revit.DB.Area
* Autodesk.Revit.DB.Architecture.RoomTag
* Autodesk.Revit.DB.Mechanical.SpaceTag
* Autodesk.Revit.DB.AreaTag
* Autodesk.Revit.DB.CombinableElement
* Autodesk.Revit.DB.Mullion
* Autodesk.Revit.DB.Panel
* Autodesk.Revit.DB.AnnotationSymbol
* Autodesk.Revit.DB.Structure.AreaReinforcementType
* Autodesk.Revit.DB.Structure.PathReinforcementType
* Autodesk.Revit.DB.AnnotationSymbolType
* Autodesk.Revit.DB.Architecture.RoomTagType
* Autodesk.Revit.DB.Mechanical.SpaceTagType
* Autodesk.Revit.DB.AreaTagType
* Autodesk.Revit.DB.Structure.TrussType

# Examples

 Copy  C#

```
// Use ElementClassFilter to find family instances whose name is 60" x 30" Student
ElementClassFilter filter = new ElementClassFilter(typeof(FamilyInstance));

// Apply the filter to the elements in the active document
FilteredElementCollector collector = new FilteredElementCollector(document);
collector.WherePasses(filter);

// Use Linq query to find family instances whose name is 60" x 30" Student
var query = from element in collector
            where element.Name == "60\" x 30\" Student"
            select element;

// Cast found elements to family instances,
// this cast to FamilyInstance is safe because ElementClassFilter for FamilyInstance was used
List<FamilyInstance> familyInstances = query.Cast<FamilyInstance>().ToList<FamilyInstance>();
```

 Copy  VB.NET

```
' Use ElementClassFilter to find family instances whose name is 60" x 30" Student
Dim filter As New ElementClassFilter(GetType(FamilyInstance))

' Apply the filter to the elements in the active document
Dim collector As New FilteredElementCollector(document)
collector.WherePasses(filter)

' Use Linq query to find family instances whose name is 60" x 30" Student
Dim query As System.Collections.Generic.IEnumerable(Of Autodesk.Revit.DB.Element)
query = From element In collector _
 Where element.Name = "60"" x 30"" Student" _
 Select element

' Cast found elements to family instances,
' this cast to FamilyInstance is safe because ElementClassFilter for FamilyInstance was used
Dim familyInstances As List(Of FamilyInstance) = query.Cast(Of FamilyInstance)().ToList()
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementFilter
  Autodesk.Revit.DB ElementQuickFilter
  Autodesk.Revit.DB ElementClassFilter

# See Also

ElementClassFilter Members

Autodesk.Revit.DB Namespace

#### IsSketchEditingSupportedForSketchBasedElement Method

---

|  |
| --- |
| SketchEditScope Class   See Also |

Checks whether the element supports sketch editing.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool IsSketchEditingSupportedForSketchBasedElement( 	ElementId elemId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsSketchEditingSupportedForSketchBasedElement ( _ 	elemId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsSketchEditingSupportedForSketchBasedElement( 	ElementId^ elemId ) ``` |

#### Parameters

elemId
:   Type:  Autodesk.Revit.DB ElementId
     The element id to be checked.

#### Return Value

True if element supports sketch editing, false otherwise.

# Remarks

This method checks if the element supports edit to all its sketches. If you want to check if this element supports edit to a particular sketch please use  IsSketchEditingSupported(ElementId)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SketchEditScope Class

Autodesk.Revit.DB Namespace

#### MassDataSillHeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Target Sill Height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MassDataSillHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MassDataSillHeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MassDataSillHeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PoundsMassPerFoot Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pounds mass per foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PoundsMassPerFoot { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PoundsMassPerFoot As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PoundsMassPerFoot { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Energy Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Energy, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Energy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Energy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Energy { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| MacroModule Class   See Also |

Releases all resources used by the  MacroModule

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

MacroModule Class

Autodesk.Revit.DB.Macros Namespace

#### GetSolidsBeingCut Method

---

|  |
| --- |
| SolidSolidCutUtils Class   See Also |

Get all the solids which are cut by the input element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetSolidsBeingCut( 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetSolidsBeingCut ( _ 	element As Element _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetSolidsBeingCut( 	Element^ element ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The input element.

#### Return Value

The ids of the solids which are cut by the input element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SolidSolidCutUtils Class

Autodesk.Revit.DB Namespace

#### ExportPatternTable Constructor

---

|  |
| --- |
| ExportPatternTable Class   See Also |

Constructs a new ExportPatternTable with default values.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExportPatternTable() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ExportPatternTable() ``` |

# See Also

ExportPatternTable Class

Autodesk.Revit.DB Namespace

#### CreateProjectLevelGUID Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Creates a GUID from Revit project for given GUIDType.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static string CreateProjectLevelGUID( 	Document document, 	IFCProjectLevelGUIDType guidType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateProjectLevelGUID ( _ 	document As Document, _ 	guidType As IFCProjectLevelGUIDType _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ CreateProjectLevelGUID( 	Document^ document,  	IFCProjectLevelGUIDType guidType ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

guidType
:   Type:  Autodesk.Revit.DB.IFC IFCProjectLevelGUIDType
     The GUID type.

#### Return Value

The guid string.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### CreateJournalable Method

---

|  |
| --- |
| ExternalEvent Class   See Also |

Creates an instance of external event which will have the ability to record its executions in the journal.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static ExternalEvent CreateJournalable( 	IExternalEventHandler handler ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateJournalable ( _ 	handler As IExternalEventHandler _ ) As ExternalEvent ``` |

| Visual C++ |
| --- |
| ``` public: static ExternalEvent^ CreateJournalable( 	IExternalEventHandler^ handler ) ``` |

#### Parameters

handler
:   Type:  Autodesk.Revit.UI IExternalEventHandler
     An instance of IExternalEventHandler which will execute the event.

#### Return Value

An instance of ExternalEvent class, which will be used to invoke the event

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

ExternalEvent Class

Autodesk.Revit.UI Namespace

#### SurfaceForegroundPatternColor Property

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

The override color of the surface foreground pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public Color SurfaceForegroundPatternColor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SurfaceForegroundPatternColor As Color 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ SurfaceForegroundPatternColor { 	Color^ get (); } ``` |

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### SetVendorId Method

---

|  |
| --- |
| SchemaBuilder Class   See Also |

Sets the ID of the third-party vendor that may access entities of this Schema under the Vendor acess level, and to generally identify the owner of this Schema.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public SchemaBuilder SetVendorId( 	string vendorId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetVendorId ( _ 	vendorId As String _ ) As SchemaBuilder ``` |

| Visual C++ |
| --- |
| ``` public: SchemaBuilder^ SetVendorId( 	String^ vendorId ) ``` |

#### Parameters

vendorId
:   Type:  System String
     The vendor id.

#### Return Value

The SchemaBuilder object may be used to add more settings.

# Remarks

This method throws an ArgumentException if the given vendor ID string is not valid. To understand the validity requirements for vendor ID strings, see the documentation for the ESSchemaBuilder method vendorIdIsValid(). Since vendor IDs are not case sensitive, the string will be converted to upper case before it is stored in the schema.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The vendorId is invalid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The SchemaBuilder has already finished building the Schema. |

# See Also

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### IsFBXExportAvailable Method

---

|  |
| --- |
| OptionalFunctionalityUtils Class   See Also |

Checks whether the FBX Export functionality is available in the installed Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool IsFBXExportAvailable() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsFBXExportAvailable As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsFBXExportAvailable() ``` |

#### Return Value

True if the FBX Export functionality is available in the installed Revit.

# Remarks

FBX Export requires presence of certain modules that are optional and may not be part of the installed Revit.

# See Also

OptionalFunctionalityUtils Class

Autodesk.Revit.DB Namespace

#### FabricationPartBrowserChanged Event

---

|  |
| --- |
| UIApplication Class   See Also |

Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public event EventHandler<FabricationPartBrowserChangedEventArgs> FabricationPartBrowserChanged ``` |

| Visual Basic |
| --- |
| ``` Public Event FabricationPartBrowserChanged As EventHandler(Of FabricationPartBrowserChangedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<FabricationPartBrowserChangedEventArgs^>^ FabricationPartBrowserChanged { 	void add (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value); 	void remove (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value); } ``` |

# Remarks

More docs about the different conditions goes here

# See Also

UIApplication Class

Autodesk.Revit.UI Namespace

#### DestinationLinetypeName Property

---

|  |
| --- |
| ExportLinetypeInfo Class   See Also |

The destination linetype name (the name of the linetype in the exported format).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string DestinationLinetypeName { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DestinationLinetypeName As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ DestinationLinetypeName { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ExportLinetypeInfo Class

Autodesk.Revit.DB Namespace

#### IsAutomatic Property

---

|  |
| --- |
| InSessionViewSheetSet Class   See Also |

Automatic order or manual order.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsAutomatic { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property IsAutomatic As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsAutomatic { 	bool get (); 	void set (bool value); } ``` |

#### Implements

 IViewSheetSet IsAutomatic

# See Also

InSessionViewSheetSet Class

Autodesk.Revit.DB Namespace

#### RecognizedField Method

---

|  |
| --- |
| Entity Class   See Also |

Checks whether a Field belongs to the same Schema as this Entity.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool RecognizedField( 	Field field ) ``` |

| Visual Basic |
| --- |
| ``` Public Function RecognizedField ( _ 	field As Field _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool RecognizedField( 	Field^ field ) ``` |

#### Parameters

field
:   Type:  Autodesk.Revit.DB.ExtensibleStorage Field
     The Field to check.

#### Return Value

True if the Field belongs to the same Schema as this Entity.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Entity Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### ClearItems Method

---

|  |
| --- |
| RebarContainer Class   See Also |

Clears all the Items stored in this Rebar Container element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void ClearItems() ``` |

| Visual Basic |
| --- |
| ``` Public Sub ClearItems ``` |

| Visual C++ |
| --- |
| ``` public: void ClearItems() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace

#### GroundPlaneHeight Property

---

|  |
| --- |
| SunAndShadowSettings Class   See Also |

Identifies the ground plane height.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double GroundPlaneHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property GroundPlaneHeight As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double GroundPlaneHeight { 	double get (); } ``` |

# See Also

SunAndShadowSettings Class

Autodesk.Revit.DB Namespace

#### DpartLayerWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DpartLayerWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DpartLayerWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DpartLayerWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetPreferredConstraintForHandle Method

---

|  |
| --- |
| RebarConstraintsManager Class   See Also |

For ShapeDriven Rebar: Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.

For FreeForm Rebar: Sets the RebarConstraint as the target for the specified RebarConstraintHandle.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetPreferredConstraintForHandle( 	RebarConstrainedHandle handle, 	RebarConstraint constraint ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetPreferredConstraintForHandle ( _ 	handle As RebarConstrainedHandle, _ 	constraint As RebarConstraint _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetPreferredConstraintForHandle( 	RebarConstrainedHandle^ handle,  	RebarConstraint^ constraint ) ``` |

#### Parameters

handle
:   Type:  Autodesk.Revit.DB.Structure RebarConstrainedHandle
     The RebarConstrainedHandle to which the new RebarConstraint is to be applied.

constraint
:   Type:  Autodesk.Revit.DB.Structure RebarConstraint
     The new RebarConstraint to be applied to the RebarConstrainedHandle.

# Remarks

ShapeDriven:

The RebarConstraint should be one of the candidate RebarConstraints returned by getConstraintCandidatesForHandle.

In general, the caller should assume that the 'set' operation can fail, as some of the candidates may be legal targets for the handle, but may cause the rebar to flex into an insoluble shape.

Once a preferred constraint has been successfully assigned to a handle, the user can still drag the handle, and the Rebar can generally be flexed in much the same way as it could before (preferred constraints do not have the same effect as Revit locked dimensions). However, the rebar's behavior will change in subtle ways.

A handle with a FixedDistanceToHostFace preferred constraint will allow the constraint's offset distance to change as the user moves the handle. However, in subsequent model updates, the handle will continue to follow the preferred constraint target, even if other legitimate constraint targets are closer to the handle. One can think of this behavior as equivalent to unlocking a locked dimension, moving one of dimension references, and then re-locking the dimension - all in one step.

When a handle with a ToCover or ToOtherRebar preferred constraint is dragged by the user, it will snap back to its constraint target, unless it is dragged beyond tolerance distance. In that case, it will select a new constraint using default logic, but will continue to treat the "broken" constraint as preferred, and will snap back to the preferred target again, if it is dragged to within tolerance distance.

If, during a model update, the rebar determines that a preferred constraint target no longer exists, or has been modified so that it is no longer a legal candidate for the handle, then the rebar will remove the preferred status of that target and will assign a new constraint to the handle using the default logic.

FreeForm:

Sets the RebarConstraint to be active for the specified RebarConstrainedHandle. The RebarConstrainedHandle needs to be a valid handle for this rebar element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | constraint is no longer valid. -or- handle is no longer valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The RebarConstraintsManager does not manage a valid Rebar element. |

# See Also

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace

#### GetBoundaryLoops Method

---

|  |
| --- |
| TessellatedFace Class   See Also |

Get loops bounding the face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IList<IList<XYZ>> GetBoundaryLoops() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBoundaryLoops As IList(Of IList(Of XYZ)) ``` |

| Visual C++ |
| --- |
| ``` public: IList<IList<XYZ^>^>^ GetBoundaryLoops() ``` |

# See Also

TessellatedFace Class

Autodesk.Revit.DB Namespace

#### StructuralSectionPipestandardWallnominalthickness Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Wall Nominal Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionPipestandardWallnominalthickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionPipestandardWallnominalthickness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionPipestandardWallnominalthickness { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsPipeSlopeDefParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Pipe Slope Definitions"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeSlopeDefParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeSlopeDefParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeSlopeDefParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ReferenceIntersector Class   See Also |

Releases all resources used by the  ReferenceIntersector

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ReferenceIntersector Class

Autodesk.Revit.DB Namespace

#### Create Method (View, XYZ, XYZ)

---

|  |
| --- |
| PathOfTravel Class   See Also |

Creates a new path of travel between two points.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public static PathOfTravel Create( 	View DBView, 	XYZ pathStart, 	XYZ pathEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	DBView As View, _ 	pathStart As XYZ, _ 	pathEnd As XYZ _ ) As PathOfTravel ``` |

| Visual C++ |
| --- |
| ``` public: static PathOfTravel^ Create( 	View^ DBView,  	XYZ^ pathStart,  	XYZ^ pathEnd ) ``` |

#### Parameters

DBView
:   Type:  Autodesk.Revit.DB View
     The floor plan view to use when computing the shortest distance.

pathStart
:   Type:  Autodesk.Revit.DB XYZ
     The start point of the path. The input Z coordinates are ignored and set to the view's level elevation.

pathEnd
:   Type:  Autodesk.Revit.DB XYZ
     The end point of the path. The input Z coordinates are ignored and set to the view's level elevation.

#### Return Value

The newly created path of travel element, or    a null reference (  Nothing  in Visual Basic)  if no path between the two points is found.

# Remarks

InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:

* View has crop box active and crop box is split
* View has crop box active and start or end point lies outside of the crop
* View model outline area is larger than the current limit (2,000,000 sq.ft.)
* View export contains too much geometry (more than 200,000 lines)
* Start and end points are too close

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element "DBView" is in a family document or a document in in-place edit mode. -or- View is not a floor plan view. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The document containing DBView is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- This operation cannot be performed while the document is in edit mode. -or- The Path of Travel calculation service is not available -or- This functionality is not available in Revit LT. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document containing DBView is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing DBView is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document containing DBView has no open transaction. |

# See Also

PathOfTravel Class

Create Overload

Autodesk.Revit.DB.Analysis Namespace

#### TryingToAttachWhenJoined Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

The column and target are joined. The attachment has been removed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TryingToAttachWhenJoined { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TryingToAttachWhenJoined As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TryingToAttachWhenJoined { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### StructuralSectionIshapeWebthicknessLocation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Web Thickness Location"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionIshapeWebthicknessLocation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionIshapeWebthicknessLocation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionIshapeWebthicknessLocation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CircularLoopInPipeSizing Property

---

|  |
| --- |
| BuiltInFailures PipingFailures Class   See Also |

Circular loop detected during pipe sizing. The loop may be avoided by modifying segment settings in the pipe routing preference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CircularLoopInPipeSizing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CircularLoopInPipeSizing As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CircularLoopInPipeSizing { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PipingFailures Class

Autodesk.Revit.DB Namespace

#### IsViewFamilyTypeValidForCallout Method

---

|  |
| --- |
| ViewSection Class   See Also |

This validator checks that the ViewFamilyType is appropriate for callout views in the input parent view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool IsViewFamilyTypeValidForCallout( 	Document document, 	ElementId viewFamilyTypeId, 	ElementId parentViewId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsViewFamilyTypeValidForCallout ( _ 	document As Document, _ 	viewFamilyTypeId As ElementId, _ 	parentViewId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsViewFamilyTypeValidForCallout( 	Document^ document,  	ElementId^ viewFamilyTypeId,  	ElementId^ parentViewId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document which contains the ViewFamilyType and parent view.

viewFamilyTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the ViewFamilyType which will be used by the new callout ViewSection. Detail ViewFamilyTypes can be used in all parent views except for CeilingPlan and Drafting views. FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation, and Detail ViewFamilyTypes may be be used in parent views that also use a type with the same ViewFamily enum value. For example, in StructuralPlan views both StructuralPlan and Detail ViewFamilyTypes are allowed.

parentViewId
:   Type:  Autodesk.Revit.DB ElementId
     The view in which the new callout will appear. Callouts can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation, and Detail views.

#### Return Value

True if the ViewFamilyType can be used for callout views in the parent view, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ViewSection Class

Autodesk.Revit.DB Namespace

#### CreateHanger Method (Document, FabricationServiceButton, Int32, ElementId)

---

|  |
| --- |
| FabricationPart Class   See Also |

Creates a free placed hanger.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static FabricationPart CreateHanger( 	Document document, 	FabricationServiceButton button, 	int condition, 	ElementId levelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateHanger ( _ 	document As Document, _ 	button As FabricationServiceButton, _ 	condition As Integer, _ 	levelId As ElementId _ ) As FabricationPart ``` |

| Visual C++ |
| --- |
| ``` public: static FabricationPart^ CreateHanger( 	Document^ document,  	FabricationServiceButton^ button,  	int condition,  	ElementId^ levelId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

button
:   Type:  Autodesk.Revit.DB FabricationServiceButton
     The fabrication service button to use.

condition
:   Type:  System Int32
     The condition index. If the button has multiple conditions.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The level identifier associated with the level.

#### Return Value

The newly-created fabrication hanger.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Invalid fabrication service button. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |

# See Also

FabricationPart Class

CreateHanger Overload

Autodesk.Revit.DB Namespace

#### Contains Method

---

|  |
| --- |
| WireSizeSet Class   See Also |

Tests for the existence of a wire size within the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Contains( 	WireSize item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Contains ( _ 	item As WireSize _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Contains( 	WireSize^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB.Electrical WireSize
     The wire size to be searched for.

#### Return Value

The Contains method returns True if the wire size is within the set, otherwise False.

# See Also

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### IsValidHorizontalBoundary Method

---

|  |
| --- |
| BoundaryValidation Class   See Also |

Identifies whether the given curve loops compose a valid horizontal boundary.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static bool IsValidHorizontalBoundary( 	IList<CurveLoop> curveLoops ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidHorizontalBoundary ( _ 	curveLoops As IList(Of CurveLoop) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidHorizontalBoundary( 	IList<CurveLoop^>^ curveLoops ) ``` |

#### Parameters

curveLoops
:   Type:  System.Collections.Generic IList   CurveLoop
     The curve loops to be checked.

#### Return Value

True if the given curve loops are valid as described above, false otherwise.

# Remarks

The curve loops are valid if projections of the loops onto a horizontal(XY) plane do not intersect each other; each curve loop is closed; input curves do not contain any helical curve; and each loop is planar and lies on a plane parallel to the horizontal(XY) plane, but not necessarily the same plane.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

BoundaryValidation Class

Autodesk.Revit.DB Namespace

#### PostScale Method

---

|  |
| --- |
| Transform2D Class   See Also |

Scales both the linear and translational parts of this transformation and returns the result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public Transform2D PostScale( 	double scale ) ``` |

| Visual Basic |
| --- |
| ``` Public Function PostScale ( _ 	scale As Double _ ) As Transform2D ``` |

| Visual C++ |
| --- |
| ``` public: Transform2D^ PostScale( 	double scale ) ``` |

#### Parameters

scale
:   Type:  System Double
     The scale value.

#### Return Value

Returns a pointer to "this"  Transform2D  .

# Remarks

The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.

# See Also

Transform2D Class

Autodesk.Revit.DB Namespace

#### WallAttrDefheightParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Default height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WallAttrDefheightParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallAttrDefheightParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WallAttrDefheightParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetExportLineweightTable Method

---

|  |
| --- |
| DGNExportOptions Class   See Also |

Gets a copy of the line weight table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExportLineweightTable GetExportLineweightTable() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetExportLineweightTable As ExportLineweightTable ``` |

| Visual C++ |
| --- |
| ``` public: ExportLineweightTable^ GetExportLineweightTable() ``` |

#### Return Value

The line weight table.

# See Also

DGNExportOptions Class

Autodesk.Revit.DB Namespace

#### DivisionSketchCurveDivisionParamsOverrideParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Profile Override"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DivisionSketchCurveDivisionParamsOverrideParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DivisionSketchCurveDivisionParamsOverrideParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DivisionSketchCurveDivisionParamsOverrideParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Transparency Property

---

|  |
| --- |
| AnalysisDisplayDeformedShapeSettings Class   See Also |

Transparency percentage of deformed shape color fill on surfaces

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int Transparency { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Transparency As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int Transparency { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | When setting this property: transparency is less than 0 or greater than 100 |

# See Also

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### BendPolylineInvalid Property

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   See Also |

The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BendPolylineInvalid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BendPolylineInvalid As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BendPolylineInvalid { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace

#### ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects Property

---

|  |
| --- |
| Application Class   See Also |

Whether or not to show the graphical open ends for Area Based Load Boundary disconnects.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects { 	bool get (); 	void set (bool value); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### TooManySlopesError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

There is more than one slope defined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TooManySlopesError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TooManySlopesError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TooManySlopesError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### CannotFinalizeOrphanSerf Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't finalize Group member without finalizing the entire Group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotFinalizeOrphanSerf { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotFinalizeOrphanSerf As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotFinalizeOrphanSerf { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### Project Method

---

|  |
| --- |
| Face Class   See Also |

Projects the specified point on the face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public IntersectionResult Project( 	XYZ point ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Project ( _ 	point As XYZ _ ) As IntersectionResult ``` |

| Visual C++ |
| --- |
| ``` public: IntersectionResult^ Project( 	XYZ^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB XYZ
     The point to be projected.

#### Return Value

Geometric information if projection is successful; if projection fails or the nearest point is outside of this face, returns    a null reference (  Nothing  in Visual Basic)  .

# Remarks

The following is the meaning of IntersectionResult's members:

* XYZPoint is the nearest point to the projected point on the face.
* UVPoint is the UV coordinates of the nearest point on the face.
* Distance is the distance from the point to the face.
* EdgeObject is the edge if projected point is near an edge.
* EdgeParameter is the parameter of the nearest point on the edge.

# See Also

Face Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| SolidOrShellTessellationControls Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

SolidOrShellTessellationControls Class

Autodesk.Revit.DB Namespace

#### GetOrderedParameters Method

---

|  |
| --- |
| Element Class   See Also |

Gets the parameters associated to the element in order.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IList<Parameter> GetOrderedParameters() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetOrderedParameters As IList(Of Parameter) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Parameter^>^ GetOrderedParameters() ``` |

#### Return Value

A collection containing all parameters.

# Remarks

The collection consists of only visible parameters associated to the element; it returns a different list than Element.Parameters.

The parameters are returned in the order in which they appear in the Revit UI within a given group; however, parameters of different groups may be mixed within this output.

Currently the Revit UI order is determined first by group and next by the order of the individual parameters.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### Determinant Property

---

|  |
| --- |
| Transform Class   See Also |

The determinant of this transformation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Determinant { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Determinant As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Determinant { 	double get (); } ``` |

# Remarks

The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.

# See Also

Transform Class

Autodesk.Revit.DB Namespace

#### PeakAirflowParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Peak Airflow"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PeakAirflowParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PeakAirflowParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PeakAirflowParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidSpecificFittingAngle Method

---

|  |
| --- |
| DuctSettings Class   See Also |

Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidSpecificFittingAngle( 	double angle ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidSpecificFittingAngle ( _ 	angle As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidSpecificFittingAngle( 	double angle ) ``` |

#### Parameters

angle
:   Type:  System Double
     The angle value (in degree).

#### Return Value

True if the given value is a valid specific fitting angle.

# See Also

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace

#### UpDirection Property

---

|  |
| --- |
| Camera Class   See Also |

Up direction of the camera

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public XYZ UpDirection { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UpDirection As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ UpDirection { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### StairsSupportUpperEndCut Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Upper End Cut": Upper End Cut

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsSupportUpperEndCut { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsSupportUpperEndCut As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsSupportUpperEndCut { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### YVector Property

---

|  |
| --- |
| PlanarFace Class   See Also |

The Y-vector of the planar face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ YVector { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property YVector As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ YVector { 	XYZ^ get (); } ``` |

# Remarks

Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector depending upon how Revit has structured this particular face.

# See Also

PlanarFace Class

Autodesk.Revit.DB Namespace

#### LoadMomentMx2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mx 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadMomentMx2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadMomentMx2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadMomentMx2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TorsionalModulus Property

---

|  |
| --- |
| StructuralSection Class   See Also |

Section modulus for calculations of torsion stresses (Ct).

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double TorsionalModulus { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TorsionalModulus As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double TorsionalModulus { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSection Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### CannotCutJoinedGeometry Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Element could not be cut by joined element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCutJoinedGeometry { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCutJoinedGeometry As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCutJoinedGeometry { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### AutoGlazingFailed Property

---

|  |
| --- |
| BuiltInFailures MassFailures Class   See Also |

Failure in Auto-Glazing region computation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AutoGlazingFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AutoGlazingFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AutoGlazingFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MassFailures Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| ExternalApplicationArrayIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

ExternalApplicationArrayIterator Class

Autodesk.Revit.UI Namespace

#### AnalysisParams Property

---

|  |
| --- |
| StructuralSection Class   See Also |

Common set of parameters for structural analysis.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public StructuralSectionAnalysisParams AnalysisParams { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AnalysisParams As StructuralSectionAnalysisParams 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property StructuralSectionAnalysisParams^ AnalysisParams { 	StructuralSectionAnalysisParams^ get (); } ``` |

# See Also

StructuralSection Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### MicroinchesPerInchDegreeFahrenheit Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Microinches per inch degree Fahrenheit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MicroinchesPerInchDegreeFahrenheit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MicroinchesPerInchDegreeFahrenheit As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MicroinchesPerInchDegreeFahrenheit { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Erase Method

---

|  |
| --- |
| GroundConductorSizeSet Class   See Also |

Removes a specified GroundConductorSize from the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Erase( 	GroundConductorSize item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Erase ( _ 	item As GroundConductorSize _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int Erase( 	GroundConductorSize^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB.Electrical GroundConductorSize
     The GroundConductorSize to be erased.

#### Return Value

The number of GroundConductorSizes that were erased from the set.

# See Also

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### UsGallons Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

US gallons.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId UsGallons { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UsGallons As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ UsGallons { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralSectionBottomCutWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Cut Width"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionBottomCutWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionBottomCutWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionBottomCutWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetBasicIEnumerator Method

---

|  |
| --- |
| PointCollection Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` internal virtual IEnumerator GetBasicIEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Friend Overridable Function GetBasicIEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` internal: virtual IEnumerator^ GetBasicIEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable GetEnumerator

# See Also

PointCollection Class

Autodesk.Revit.DB.PointClouds Namespace

#### SolidUtils Class

---

|  |
| --- |
| Members   See Also |

Contains utility functions for solid operations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static class SolidUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class SolidUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class SolidUtils abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB SolidUtils

# See Also

SolidUtils Members

Autodesk.Revit.DB Namespace

#### SurfaceRotation Property

---

|  |
| --- |
| AdvancedGlazing Class   See Also |

The property labeled "Rotation" from the "AdvancedGlazing" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static string SurfaceRotation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceRotation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SurfaceRotation { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble". This property allows a connected asset.

# See Also

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace

#### IsMeasurableSpec Method

---

|  |
| --- |
| UnitUtils Class   See Also |

Checks whether a ForgeTypeId identifies a spec associated with units of measurement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool IsMeasurableSpec( 	ForgeTypeId specTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsMeasurableSpec ( _ 	specTypeId As ForgeTypeId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsMeasurableSpec( 	ForgeTypeId^ specTypeId ) ``` |

#### Parameters

specTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     The identifier to check.

#### Return Value

True if the ForgeTypeId identifies a measurable spec, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

UnitUtils Class

Autodesk.Revit.DB Namespace

#### Area Property

---

|  |
| --- |
| MassSurfaceData Class   See Also |

Area of the references that the MassSurfaceData provides properties for.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double Area { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Area As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Area { 	double get (); } ``` |

# Remarks

If it is used, should be greater than zero. Otherwise, it will be zero.

# See Also

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace

#### NewFlexPipe Method (IList(XYZ), FlexPipeType)

---

|  |
| --- |
| Document Class   See Also |

Adds a new flexible pipe into the document, using a point array and pipe type.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FlexPipe NewFlexPipe( 	IList<XYZ> points, 	FlexPipeType pipeType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFlexPipe ( _ 	points As IList(Of XYZ), _ 	pipeType As FlexPipeType _ ) As FlexPipe ``` |

| Visual C++ |
| --- |
| ``` public: FlexPipe^ NewFlexPipe( 	IList<XYZ^>^ points,  	FlexPipeType^ pipeType ) ``` |

#### Parameters

points
:   Type:  System.Collections.Generic IList   XYZ
     The point array indicating the path of the flexible pipe, including the end points.

pipeType
:   Type:  Autodesk.Revit.DB.Plumbing FlexPipeType
     The type of the flexible pipe.

#### Return Value

If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument points is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the flexible pipe cannot be created or regenerate fails. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the flexible pipe type does not exist in the given document. |

# See Also

Document Class

NewFlexPipe Overload

Autodesk.Revit.Creation Namespace

#### IsValidObject Property

---

|  |
| --- |
| ReferenceIntersector Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ReferenceIntersector Class

Autodesk.Revit.DB Namespace

#### IsEqual Method

---

|  |
| --- |
| NumericRevisionSettings Class   See Also |

Determines whether a specified NumericRevisionSettings is the same as 'this'.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsEqual( 	NumericRevisionSettings other ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsEqual ( _ 	other As NumericRevisionSettings _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsEqual( 	NumericRevisionSettings^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB NumericRevisionSettings
     The specified NumericRevisionSettings with which to compare.

#### Return Value

True, if two NumericRevisionSettings are the same.

# Remarks

The two NumericRevisionSettings are regarded as the same only if they have the same start number, prefix and suffix strings.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace

#### GetCellStyleOverrideOptions Method

---

|  |
| --- |
| TableCellStyle Class   See Also |

Gets cell style override options of this cell.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public TableCellStyleOverrideOptions GetCellStyleOverrideOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCellStyleOverrideOptions As TableCellStyleOverrideOptions ``` |

| Visual C++ |
| --- |
| ``` public: TableCellStyleOverrideOptions^ GetCellStyleOverrideOptions() ``` |

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### ShowElements Method (ICollection(ElementId))

---

|  |
| --- |
| UIDocument Class   See Also |

Shows the elements by zoom to fit.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void ShowElements( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ShowElements ( _ 	elementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ShowElements( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The set of element ids which will be shown.

# Remarks

Places all the elements on the screen by moving the view.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | elementIds is null. |
| Autodesk.Revit.Exceptions ArgumentException | Member of elementIds is null. |
| Autodesk.Revit.Exceptions ArgumentException | Member of elementIds is not valid. |

# See Also

UIDocument Class

ShowElements Overload

Autodesk.Revit.UI Namespace

#### IViewSheetSet Interface

---

|  |
| --- |
| Members   Example   See Also |

This interface represents a selected set of views/sheets which will be used for printing.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public interface IViewSheetSet ``` |

| Visual Basic |
| --- |
| ``` Public Interface IViewSheetSet ``` |

| Visual C++ |
| --- |
| ``` public interface class IViewSheetSet ``` |

# Examples

 Copy  C#

```
private void SwitchToAutomaticOrder(Document doc, ViewSheetSetting viewSheetSetting)
{
   IViewSheetSet viewSheetSet = viewSheetSetting.CurrentViewSheetSet;
   var sheetBrowserOrg = BrowserOrganization.GetCurrentBrowserOrganizationForSheets(doc);
   var viewBrowserOrg = BrowserOrganization.GetCurrentBrowserOrganizationForViews(doc);
   viewSheetSet.SheetOrganizationId = sheetBrowserOrg.Id;
   viewSheetSet.ViewOrganizationId = viewBrowserOrg.Id;
   viewSheetSet.IsAutomatic = true; // IsAutomatic must be true then views and sheets will be ordered by Browser Organization
}

private void SwitchToCustomOrder(Document doc, ViewSheetSetting viewSheetSetting, IReadOnlyList<View> customViews)
{
   IViewSheetSet viewSheetSet = viewSheetSetting.CurrentViewSheetSet;
   // IsAutomatic must be false, then OrderedViewList will be organized in custom order
   // Note that the moment you set IsAutomatic from true to false, the order in OrderedViewList will be organized by Browser Organization
   viewSheetSet.IsAutomatic = false; // IMPORTANT: IsAutomatic before assigning OrderedViewList
   viewSheetSet.OrderedViewList = customViews;
}
```

# See Also

IViewSheetSet Members

Autodesk.Revit.DB Namespace

#### StairsAttrRiserType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Riser Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrRiserType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrRiserType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrRiserType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NewTypeBinding Method (CategorySet)

---

|  |
| --- |
| Application Class   See Also |

Creates a new type binding object containing the categories passed as a parameter.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public TypeBinding NewTypeBinding( 	CategorySet categorySet ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewTypeBinding ( _ 	categorySet As CategorySet _ ) As TypeBinding ``` |

| Visual C++ |
| --- |
| ``` public: TypeBinding^ NewTypeBinding( 	CategorySet^ categorySet ) ``` |

#### Parameters

categorySet
:   Type:  Autodesk.Revit.DB CategorySet
     A set of categories that will be added to the binding.

#### Return Value

A new type binding object.

# Remarks

Type binding objects are used for attaching shared parameter definitions to a type within a category.

# See Also

Application Class

NewTypeBinding Overload

Autodesk.Revit.Creation Namespace

#### ViewGraphSchedLocationsHigh Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Column Locations End"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewGraphSchedLocationsHigh { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewGraphSchedLocationsHigh As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewGraphSchedLocationsHigh { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Level Property

---

|  |
| --- |
| DuctPressureDropData Class   See Also |

The calculation level of the system.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public SystemCalculationLevel Level { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Level As SystemCalculationLevel 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property SystemCalculationLevel Level { 	SystemCalculationLevel get (); } ``` |

# Remarks

If the calculation level is Flow, all parameters that need friction will be displayed as "Not Computed" in Properties dialog (Friction, Pressure Drop, Loss Coefficient). If the calculation level is None, all parameters that need flow will be displayed as "Not Computed" in Properties dialog (Velocity, Velocity Pressure, Reynolds number, Friction, Pressure Drop, Loss Coefficient). If the calculation level is All, all parameters will be displayed with their actual values in Properties dialog.

# See Also

DuctPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace

#### FeetPerKip Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Feet per kip.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FeetPerKip { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FeetPerKip As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FeetPerKip { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### SetHookTangentLength Method

---

|  |
| --- |
| RebarBarType Class   See Also |

Identifies the hook tangent length for a hook type

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetHookTangentLength( 	ElementId hookId, 	double newLength ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetHookTangentLength ( _ 	hookId As ElementId, _ 	newLength As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetHookTangentLength( 	ElementId^ hookId,  	double newLength ) ``` |

#### Parameters

hookId
:   Type:  Autodesk.Revit.DB ElementId
     id of the hook type

newLength
:   Type:  System Double
     The hook tangent length for a hook type

# Remarks

AutoCalcHookLengths is ignored when this property is set

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | the rebar hook type id hookId is not valid |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace

#### Name Property

---

|  |
| --- |
| Dimension Class   See Also |

Retrieves or changes the name associated with the Dimension.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string Name { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Name As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Name { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

The property inherited from element is hidden, a System.InvalidOperationException is thrown.

# See Also

Dimension Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| MEPConnectorInfo Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace

#### NewGeometryOptions Method

---

|  |
| --- |
| Application Class   Example   See Also |

Creates an object to specify user preferences in parsing of geometry.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Options NewGeometryOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function NewGeometryOptions As Options ``` |

| Visual C++ |
| --- |
| ``` public: Options^ NewGeometryOptions() ``` |

#### Return Value

# Examples

 Copy  C#

```
Autodesk.Revit.DB.Options geomOption = application.Create.NewGeometryOptions();
if (null != geomOption)
{
    geomOption.ComputeReferences = true;
    geomOption.DetailLevel = Autodesk.Revit.DB.ViewDetailLevel.Fine;

    // Either the DetailLevel or the View can be set, but not both
    //geomOption.View = commandData.Application.Application.ActiveDocument.ActiveView;

    TaskDialog.Show("Revit", "Geometry Option created successfully.");
}
```

 Copy  VB.NET

```
Dim geomOption As Autodesk.Revit.DB.Options = application.Create.NewGeometryOptions()
If geomOption IsNot Nothing Then
    geomOption.ComputeReferences = True
    geomOption.DetailLevel = Autodesk.Revit.DB.ViewDetailLevel.Fine

    ' Either the DetailLevel or the View can be set, but not both
    'geomOption.View = commandData.Application.Application.ActiveDocument.ActiveView;

    TaskDialog.Show("Revit", "Geometry Option created successfully.")
End If
```

# See Also

Application Class

Autodesk.Revit.Creation Namespace

#### StairsTrisertypeFrontNosing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Front Nosing": (OBSOLETE)

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsTrisertypeFrontNosing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsTrisertypeFrontNosing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsTrisertypeFrontNosing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralSectionConcreteRound Constructor

---

|  |
| --- |
| StructuralSectionConcreteRound Class   See Also |

Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters, used to attach to structural element.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public StructuralSectionConcreteRound( 	double diameter, 	double centroidHorizontal, 	double centroidVertical, 	double principalAxesAngle, 	double sectionArea, 	double perimeter, 	double nominalWeight, 	double momentOfInertiaStrongAxis, 	double momentOfInertiaWeakAxis, 	double elasticModulusStrongAxis, 	double elasticModulusWeakAxis, 	double plasticModulusStrongAxis, 	double plasticModulusWeakAxis, 	double torsionalMomentOfInertia, 	double torsionalModulus, 	double warpingConstant, 	double shearAreaStrongAxis, 	double shearAreaWeakAxis ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	diameter As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	principalAxesAngle As Double, _ 	sectionArea As Double, _ 	perimeter As Double, _ 	nominalWeight As Double, _ 	momentOfInertiaStrongAxis As Double, _ 	momentOfInertiaWeakAxis As Double, _ 	elasticModulusStrongAxis As Double, _ 	elasticModulusWeakAxis As Double, _ 	plasticModulusStrongAxis As Double, _ 	plasticModulusWeakAxis As Double, _ 	torsionalMomentOfInertia As Double, _ 	torsionalModulus As Double, _ 	warpingConstant As Double, _ 	shearAreaStrongAxis As Double, _ 	shearAreaWeakAxis As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionConcreteRound( 	double diameter,  	double centroidHorizontal,  	double centroidVertical,  	double principalAxesAngle,  	double sectionArea,  	double perimeter,  	double nominalWeight,  	double momentOfInertiaStrongAxis,  	double momentOfInertiaWeakAxis,  	double elasticModulusStrongAxis,  	double elasticModulusWeakAxis,  	double plasticModulusStrongAxis,  	double plasticModulusWeakAxis,  	double torsionalMomentOfInertia,  	double torsionalModulus,  	double warpingConstant,  	double shearAreaStrongAxis,  	double shearAreaWeakAxis ) ``` |

#### Parameters

diameter
:   Type:  System Double
     Pipe Diameter.

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

principalAxesAngle
:   Type:  System Double
     Rotation angle between the principal axes and cross section reference planes.

sectionArea
:   Type:  System Double
     Cross section area.

perimeter
:   Type:  System Double
     Painting surface of the unit length.

nominalWeight
:   Type:  System Double
     Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

momentOfInertiaStrongAxis
:   Type:  System Double
     Moment of Inertia about main strong axis (I).

momentOfInertiaWeakAxis
:   Type:  System Double
     Moment of Inertia about main weak axis (I).

elasticModulusStrongAxis
:   Type:  System Double
     Elastic section modulus about main strong axis for calculation of bending stresses.

elasticModulusWeakAxis
:   Type:  System Double
     Elastic section modulus about main weak axis for calculation of bending stresses.

plasticModulusStrongAxis
:   Type:  System Double
     Plastic section modulus in bending about main strong axis (Z, Wpl).

plasticModulusWeakAxis
:   Type:  System Double
     Plastic section modulus in bending about main weak axis.

torsionalMomentOfInertia
:   Type:  System Double
     Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation.

torsionalModulus
:   Type:  System Double
     Section modulus for calculations of torsion stresses (Ct).

warpingConstant
:   Type:  System Double
     Warping constant (Cw, Iomega, H).

shearAreaStrongAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

shearAreaWeakAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

# See Also

StructuralSectionConcreteRound Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### MH2OPerM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol mH2O/m, indicating unit Meters of water column per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MH2OPerM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MH2OPerM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MH2OPerM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### GetGroupTypeId Method

---

|  |
| --- |
| ExternalDefinition Class   See Also |

Returns the identifier of the parameter definition's parameter group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public override ForgeTypeId GetGroupTypeId() ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Function GetGroupTypeId As ForgeTypeId ``` |

| Visual C++ |
| --- |
| ``` public: virtual ForgeTypeId^ GetGroupTypeId() override ``` |

# See Also

ExternalDefinition Class

Autodesk.Revit.DB Namespace

#### CanFlipEnds Method

---

|  |
| --- |
| StructuralFramingUtils Class   See Also |

Determines if the ends of the given framing element can be flipped.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015 Subscription Update

# Syntax

| C# |
| --- |
| ``` public static bool CanFlipEnds( 	FamilyInstance familyInstance ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CanFlipEnds ( _ 	familyInstance As FamilyInstance _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CanFlipEnds( 	FamilyInstance^ familyInstance ) ``` |

#### Parameters

familyInstance
:   Type:  Autodesk.Revit.DB FamilyInstance
     The FamilyInstance, which must be of a structural framing category, non-concrete.

#### Return Value

True for non-concrete line, arc or ellipse framing element, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

StructuralFramingUtils Class

Autodesk.Revit.DB.Structure Namespace

#### ExportPatternKey Constructor

---

|  |
| --- |
| ExportPatternKey Class   See Also |

Constructs a new default ExportPatternKey.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExportPatternKey() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ExportPatternKey() ``` |

# See Also

ExportPatternKey Class

ExportPatternKey Overload

Autodesk.Revit.DB Namespace

#### IsFailureResolutionPermitted Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Checks if resolution of failures is permitted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool IsFailureResolutionPermitted() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsFailureResolutionPermitted As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsFailureResolutionPermitted() ``` |

#### Return Value

True if resolutions of failures is permitted.

# See Also

FailuresAccessor Class

IsFailureResolutionPermitted Overload

Autodesk.Revit.DB Namespace

#### ControlShape Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing four shapes of control that Autodesk Revit supports.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ControlShape ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ControlShape ``` |

| Visual C++ |
| --- |
| ``` public enum class ControlShape ``` |

# Members

| Member name | Description |
| --- | --- |
| VerticalArrow | Vertical arrow. |
| HorizontalArrow | Horizontal arrow. |
| DoubleVerticalArrow | Double vertical arrow. |
| DoubleHorizontalArrow | Double horizontal arrow. |

# See Also

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| Selection Class   See Also |

Releases all resources used by the  Selection

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

Selection Class

Autodesk.Revit.UI.Selection Namespace

#### NumberOfTargets Property

---

|  |
| --- |
| RebarConstraint Class   See Also |

Identifies the number of references associated to the rebar handle.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public int NumberOfTargets { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfTargets As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfTargets { 	int get (); } ``` |

# See Also

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace

#### HandrailProjectionParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Projection"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HandrailProjectionParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HandrailProjectionParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HandrailProjectionParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IfcOrganization Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"IfcOrganization"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IfcOrganization { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IfcOrganization As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IfcOrganization { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ArrayLength Property

---

|  |
| --- |
| RebarInSystem Class   See Also |

Identifies the distribution path length of rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double ArrayLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ArrayLength As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ArrayLength { 	double get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace

#### BuildingType Enumeration

---

|  |
| --- |
| See Also |

This enumeration is used for specifying the most predominant building use type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum BuildingType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BuildingType ``` |

| Visual C++ |
| --- |
| ``` public enum class BuildingType ``` |

# Members

| Member name | Description |
| --- | --- |
| kNoOfBuildingTypes | Building Type is NoOfBuildingTypes. |
| kAutomotiveFacility | Building Type is AutomotiveFacility. |
| kConventionCenter | Building Type is ConventionCenter. |
| kCourthouse | Building Type is Courthouse. |
| kDiningBarLoungeOrLeisure | Building Type is DiningBarLoungeOrLeisure. |
| kDiningCafeteriaFastFood | Building Type is DiningCafeteriaFastFood. |
| kDiningFamily | Building Type is DiningFamily. |
| kDormitory | Building Type is Dormitory. |
| kExerciseCenter | Building Type is ExerciseCenter. |
| kFireStation | Building Type is FireStation. |
| kGymnasium | Building Type is Gymnasium. |
| kHospitalOrHealthcare | Building Type is HospitalOrHealthcare. |
| kHotel | Building Type is Hotel. |
| kLibrary | Building Type is Library. |
| kManufacturing | Building Type is Manufacturing. |
| kMotel | Building Type is Motel. |
| kMotionPictureTheatre | Building Type is MotionPictureTheatre. |
| kMultiFamily | Building Type is MultiFamily. |
| kMuseum | Building Type is Museum. |
| kOffice | Building Type is Office. |
| kParkingGarage | Building Type is ParkingGarage. |
| kPenitentiary | Building Type is Penitentiary. |
| kPerformingArtsTheater | Building Type is PerformingArtsTheater. |
| kPoliceStation | Building Type is PoliceStation. |
| kPostOffice | Building Type is PostOffice. |
| kReligiousBuilding | Building Type is ReligiousBuilding. |
| kRetail | Building Type is Retail. |
| kSchoolOrUniversity | Building Type is SchoolOrUniversity. |
| kSportsArena | Building Type is SportsArena. |
| kTownHall | Building Type is TownHall. |
| kTransportation | Building Type is Transportation. |
| kWarehouse | Building Type is Warehouse. |
| kWorkshop | Building Type is Workshop. |

# Remarks

This enumerated list corresponds to the buildingType attribute in the gbXML (Green Building XML) schema and is primarily used for energy analysis.

# See Also

Autodesk.Revit.DB Namespace

#### SpacePowerLoadPerAreaParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Power Load per area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacePowerLoadPerAreaParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacePowerLoadPerAreaParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacePowerLoadPerAreaParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsShownInPlanRCPCut Property

---

|  |
| --- |
| FamilyElementVisibility Class   See Also |

Indicates if the instance is displayed when cut in Plan/RCP (if the category permits).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsShownInPlanRCPCut { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsShownInPlanRCPCut As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsShownInPlanRCPCut { 	bool get (); 	void set (bool value); } ``` |

# Remarks

controls whether the Model Family Element is shown when a FamilyInstance of that Family is cut in a Plan/RCP view, i.e. the cut plane passes through the bounding box of the instance. It only has a meaning for categories that are "cut in the symbol". For non-cuttable categories it is always false and for ones that are "cuttable in the instance" it is the same as the IsShownInTopBottom.

# See Also

FamilyElementVisibility Class

Autodesk.Revit.DB Namespace

#### RemoveProfile Method

---

|  |
| --- |
| Truss Class   See Also |

Remove the profile of a truss.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void RemoveProfile() ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveProfile ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveProfile() ``` |

# See Also

Truss Class

Autodesk.Revit.DB.Structure Namespace

#### IsSet Property

---

|  |
| --- |
| BoundingBoxXYZ Class   See Also |

Indicates whether the bounding box is set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsSet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsSet As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsSet { 	bool get (); } ``` |

# Remarks

Bounding box is considered set when it contains at least one point and "Enabled" is set to "true".

# See Also

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace

#### AssemblyViewUtils Class

---

|  |
| --- |
| Members   Example   See Also |

Utilities that provide capabilities related to assembly view creation and validation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static class AssemblyViewUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class AssemblyViewUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class AssemblyViewUtils abstract sealed ``` |

# Examples

 Copy  C#

```
private ViewSchedule CreateScheduleForAssembly(Document doc, AssemblyInstance assemblyInstance, ElementId viewTemplateId)
{
    ViewSchedule schedule = null;
    if (assemblyInstance.AllowsAssemblyViewCreation()) // create assembly views for this assembly instance
    {
        using (Transaction transaction = new Transaction(doc))
        {
            transaction.Start("Create Schedule");

            // use naming category for the schedule
            if (ViewSchedule.IsValidCategoryForSchedule(assemblyInstance.NamingCategoryId))
            {
                schedule = AssemblyViewUtils.CreateSingleCategorySchedule(doc, assemblyInstance.Id, assemblyInstance.NamingCategoryId, viewTemplateId, false);
            }
            transaction.Commit();

            if (schedule != null && transaction.GetStatus() == TransactionStatus.Committed)
            {
                transaction.Start("Edit Schedule");
                schedule.Name = "AssemblyViewSchedule";
                transaction.Commit();
            }
        }
    }

    return schedule;
}
```

 Copy  VB.NET

```
Private Function CreateScheduleForAssembly(doc As Document, assemblyInstance As AssemblyInstance, viewTemplateId As ElementId) As ViewSchedule
    Dim schedule As ViewSchedule = Nothing
    If assemblyInstance.AllowsAssemblyViewCreation() Then
        ' create assembly views for this assembly instance
        Using transaction As New Transaction(doc)
            transaction.Start("Create Schedule")

            ' use naming category for the schedule
            If ViewSchedule.IsValidCategoryForSchedule(assemblyInstance.NamingCategoryId) Then
                schedule = AssemblyViewUtils.CreateSingleCategorySchedule(doc, assemblyInstance.Id, assemblyInstance.NamingCategoryId, viewTemplateId, False)
            End If
            transaction.Commit()

            If schedule IsNot Nothing AndAlso transaction.GetStatus() = TransactionStatus.Committed Then
                transaction.Start("Edit Schedule")
                schedule.Name = "AssemblyViewSchedule"
                transaction.Commit()
            End If
        End Using
    End If

    Return schedule
End Function

Private Function IExternalCommand_Execute(commandData As ExternalCommandData, ByRef message As String, elements As ElementSet) As Result Implements IExternalCommand.Execute
    Throw New NotImplementedException()
End Function
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB AssemblyViewUtils

# See Also

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace

#### NoKeynoteAssignedToLinkedElement Property

---

|  |
| --- |
| BuiltInFailures KeynoteTagFailures Class   See Also |

The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoKeynoteAssignedToLinkedElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoKeynoteAssignedToLinkedElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoKeynoteAssignedToLinkedElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures KeynoteTagFailures Class

Autodesk.Revit.DB Namespace

#### RbsElecEnclosure Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Enclosure"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecEnclosure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecEnclosure As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecEnclosure { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarShapeDefinitionBySegments Constructor

---

|  |
| --- |
| RebarShapeDefinitionBySegments Class   See Also |

Create a rebar shape definition with a given number of segments.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public RebarShapeDefinitionBySegments( 	Document doc, 	int numberOfSegments ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	doc As Document, _ 	numberOfSegments As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: RebarShapeDefinitionBySegments( 	Document^ doc,  	int numberOfSegments ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     A document. The definition object is not a part of the document, but it will contain references to parameters that are in a document. The definition can be used for RebarShape creation only in the specified document.

numberOfSegments
:   Type:  System Int32
     The number of segments in the definition.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | numberOfSegments must be at least 1. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarShapeDefinitionBySegments Class

Autodesk.Revit.DB.Structure Namespace

#### StructuralSectionCParallelFlange Constructor

---

|  |
| --- |
| StructuralSectionCParallelFlange Class   See Also |

Creates a new instance of Structural Section C Parallel Flange shape with the associated set of parameters, used to attach to structural element.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public StructuralSectionCParallelFlange( 	double width, 	double height, 	double flangeThickness, 	double webThickness, 	double webFillet, 	double centroidHorizontal, 	double centroidVertical, 	double principalAxesAngle, 	double sectionArea, 	double perimeter, 	double nominalWeight, 	double momentOfInertiaStrongAxis, 	double momentOfInertiaWeakAxis, 	double elasticModulusStrongAxis, 	double elasticModulusWeakAxis, 	double plasticModulusStrongAxis, 	double plasticModulusWeakAxis, 	double torsionalMomentOfInertia, 	double torsionalModulus, 	double warpingConstant, 	double shearAreaStrongAxis, 	double shearAreaWeakAxis, 	double clearWebHeight, 	double flangeToeOfFillet, 	double webToeOfFillet, 	double boltSpacing, 	double boltDiameter ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	height As Double, _ 	flangeThickness As Double, _ 	webThickness As Double, _ 	webFillet As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	principalAxesAngle As Double, _ 	sectionArea As Double, _ 	perimeter As Double, _ 	nominalWeight As Double, _ 	momentOfInertiaStrongAxis As Double, _ 	momentOfInertiaWeakAxis As Double, _ 	elasticModulusStrongAxis As Double, _ 	elasticModulusWeakAxis As Double, _ 	plasticModulusStrongAxis As Double, _ 	plasticModulusWeakAxis As Double, _ 	torsionalMomentOfInertia As Double, _ 	torsionalModulus As Double, _ 	warpingConstant As Double, _ 	shearAreaStrongAxis As Double, _ 	shearAreaWeakAxis As Double, _ 	clearWebHeight As Double, _ 	flangeToeOfFillet As Double, _ 	webToeOfFillet As Double, _ 	boltSpacing As Double, _ 	boltDiameter As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionCParallelFlange( 	double width,  	double height,  	double flangeThickness,  	double webThickness,  	double webFillet,  	double centroidHorizontal,  	double centroidVertical,  	double principalAxesAngle,  	double sectionArea,  	double perimeter,  	double nominalWeight,  	double momentOfInertiaStrongAxis,  	double momentOfInertiaWeakAxis,  	double elasticModulusStrongAxis,  	double elasticModulusWeakAxis,  	double plasticModulusStrongAxis,  	double plasticModulusWeakAxis,  	double torsionalMomentOfInertia,  	double torsionalModulus,  	double warpingConstant,  	double shearAreaStrongAxis,  	double shearAreaWeakAxis,  	double clearWebHeight,  	double flangeToeOfFillet,  	double webToeOfFillet,  	double boltSpacing,  	double boltDiameter ) ``` |

#### Parameters

width
:   Type:  System Double
     Section width.

height
:   Type:  System Double
     Section height, depth.

flangeThickness
:   Type:  System Double
     Flange Thickness.

webThickness
:   Type:  System Double
     Web Thickness.

webFillet
:   Type:  System Double
     Web Fillet - fillet radius between web and flange.

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

principalAxesAngle
:   Type:  System Double
     Rotation angle between the principal axes and cross section reference planes.

sectionArea
:   Type:  System Double
     Cross section area.

perimeter
:   Type:  System Double
     Painting surface of the unit length.

nominalWeight
:   Type:  System Double
     Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

momentOfInertiaStrongAxis
:   Type:  System Double
     Moment of Inertia about main strong axis (I).

momentOfInertiaWeakAxis
:   Type:  System Double
     Moment of Inertia about main weak axis (I).

elasticModulusStrongAxis
:   Type:  System Double
     Elastic section modulus about main strong axis for calculation of bending stresses.

elasticModulusWeakAxis
:   Type:  System Double
     Elastic section modulus about main weak axis for calculation of bending stresses.

plasticModulusStrongAxis
:   Type:  System Double
     Plastic section modulus in bending about main strong axis (Z, Wpl)

plasticModulusWeakAxis
:   Type:  System Double
     Plastic section modulus in bending about main weak axis.

torsionalMomentOfInertia
:   Type:  System Double
     Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation

torsionalModulus
:   Type:  System Double
     Section modulus for calculations of torsion stresses (Ct)

warpingConstant
:   Type:  System Double
     Warping constant (Cw, Iomega, H)

shearAreaStrongAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

shearAreaWeakAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

clearWebHeight
:   Type:  System Double
     Detailing depth between the web toes of the fillets, in.(mm)

flangeToeOfFillet
:   Type:  System Double
     Detailing distance from center of web to flange toe of fillet, in. (mm)

webToeOfFillet
:   Type:  System Double
     Detailing distance from outer face of flange to web toe of fillet, in. (mm)

boltSpacing
:   Type:  System Double
     Standard bolt spacing, in. (mm)

boltDiameter
:   Type:  System Double
     Maximum bolt hole diameter, in. (mm)

# See Also

StructuralSectionCParallelFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### LoadClassification Property

---

|  |
| --- |
| SpecTypeId Reference Class   See Also |

Load Classification, in discipline Electrical.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadClassification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadClassification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadClassification { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Reference Class

Autodesk.Revit.DB Namespace

#### VendorId Property

---

|  |
| --- |
| Schema Class   See Also |

The id of the third-party vendor that may access entities of this Schema under the Vendor access level.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public string VendorId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VendorId As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ VendorId { 	String^ get (); } ``` |

# See Also

Schema Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### SetbackTooLarge Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Setback computations are too large for this element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SetbackTooLarge { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SetbackTooLarge As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SetbackTooLarge { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### FabricParamSpanSymRight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Right"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricParamSpanSymRight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricParamSpanSymRight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricParamSpanSymRight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MajorSpacing Property

---

|  |
| --- |
| FabricSheetType Class   See Also |

The spacing between the wires in the major direction (not including the overhangs).

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double MajorSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MajorSpacing As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double MajorSpacing { 	double get (); } ``` |

# See Also

FabricSheetType Class

Autodesk.Revit.DB.Structure Namespace

#### TransferringProjectStandards Event

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017.2

# Syntax

| C# |
| --- |
| ``` public event EventHandler<TransferringProjectStandardsEventArgs> TransferringProjectStandards ``` |

| Visual Basic |
| --- |
| ``` Public Event TransferringProjectStandards As EventHandler(Of TransferringProjectStandardsEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<TransferringProjectStandardsEventArgs^>^ TransferringProjectStandards { 	void add (EventHandler<TransferringProjectStandardsEventArgs^>^ value); 	void remove (EventHandler<TransferringProjectStandardsEventArgs^>^ value); } ``` |

# Remarks

This event allows an external application to add additional items to the possible list of items to be transferred. These items will be visible and selectable in the Transfer Project Standards dialog box. By default, new items added in this manner will be enabled for transfer. During the scope of this event, modification is not permitted to either the source or target documents. And this event is not cancellable.

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### Erase Method

---

|  |
| --- |
| CurtainGridSet Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Erase( 	CurtainGrid item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Erase ( _ 	item As CurtainGrid _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int Erase( 	CurtainGrid^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB CurtainGrid

# See Also

CurtainGridSet Class

Autodesk.Revit.DB Namespace

#### SetProjectionType Method

---

|  |
| --- |
| CurveByPointsUtils Class   See Also |

Sets the projection type of the CurveElement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static void SetProjectionType( 	CurveElement curveElem, 	CurveProjectionType value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SetProjectionType ( _ 	curveElem As CurveElement, _ 	value As CurveProjectionType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SetProjectionType( 	CurveElement^ curveElem,  	CurveProjectionType value ) ``` |

#### Parameters

curveElem
:   Type:  Autodesk.Revit.DB CurveElement
     The CurveElement.

value
:   Type:  Autodesk.Revit.DB CurveProjectionType
     The input projection type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input CurveElement is not a CurveByPoints. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| SymbolGeometryId Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

SymbolGeometryId Class

Autodesk.Revit.DB Namespace

#### RemoveLoadClassification Method

---

|  |
| --- |
| PanelScheduleData Class   See Also |

Remove a Load Classification Id from the array of Load Classifications

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void RemoveLoadClassification( 	int nIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveLoadClassification ( _ 	nIndex As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveLoadClassification( 	int nIndex ) ``` |

#### Parameters

nIndex
:   Type:  System Int32
     The index at which to remove the load classification

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### ReplaceParameter Method (FamilyParameter, ExternalDefinition, BuiltInParameterGroup, Boolean)

---

|  |
| --- |
| FamilyManager Class   See Also |

Replace a family parameter with a shared parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyParameter ReplaceParameter( 	FamilyParameter currentParameter, 	ExternalDefinition familyDefinition, 	BuiltInParameterGroup parameterGroup, 	bool isInstance ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ReplaceParameter ( _ 	currentParameter As FamilyParameter, _ 	familyDefinition As ExternalDefinition, _ 	parameterGroup As BuiltInParameterGroup, _ 	isInstance As Boolean _ ) As FamilyParameter ``` |

| Visual C++ |
| --- |
| ``` public: FamilyParameter^ ReplaceParameter( 	FamilyParameter^ currentParameter,  	ExternalDefinition^ familyDefinition,  	BuiltInParameterGroup parameterGroup,  	bool isInstance ) ``` |

#### Parameters

currentParameter
:   Type:  Autodesk.Revit.DB FamilyParameter
     The current family parameter.

familyDefinition
:   Type:  Autodesk.Revit.DB ExternalDefinition
     The definition of the loaded shared parameter.

parameterGroup
:   Type:  Autodesk.Revit.DB BuiltInParameterGroup
     The group to which the new shared parameter belongs.

isInstance
:   Type:  System Boolean
     Indicates if the new parameter is instance or type.

#### Return Value

If replacement was successful the new shared parameter is returned, otherwise an exception with failure information will be thrown.

# Remarks

This operation is invalid for Built-in Parameters. The formulas and labels which in reference to this parameter will be updated to the new parameter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument-"familyParameter" or "name"-is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input argument-"familyParameter"-is invalid, or the input parameter group cannot be assigned to the new parameter, or the input name string contains illegal characters, or duplicated with existing parameter name. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when trying to replace a built-in parameter. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when replacement failed, because the replacement would cause a formula error. Or trying to replace with an instance parameter of image type. |

# See Also

FamilyManager Class

ReplaceParameter Overload

Autodesk.Revit.DB Namespace

#### CanChangeReporting Method

---

|  |
| --- |
| GlobalParameter Class   See Also |

Tests whether the global parameter permits a change of its current value of the IsReporting attribute.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool CanChangeReporting() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanChangeReporting As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanChangeReporting() ``` |

#### Return Value

Returns True if the change is allowed; False otherwise.

# See Also

GlobalParameter Class

Autodesk.Revit.DB Namespace

#### GlazingColorByObject Property

---

|  |
| --- |
| Glazing Class   See Also |

The property labeled "Color By Object" from the "Glazing" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string GlazingColorByObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GlazingColorByObject As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ GlazingColorByObject { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Glazing Class

Autodesk.Revit.DB.Visual Namespace

#### EngineIdentifier Property

---

|  |
| --- |
| PointCloudType Class   See Also |

The identifier of the engine responsible for handling of the point cloud.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public string EngineIdentifier { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property EngineIdentifier As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ EngineIdentifier { 	String^ get (); } ``` |

# Remarks

The built-in engine provides "pcg" here.

# See Also

PointCloudType Class

Autodesk.Revit.DB Namespace

#### AppendShape Method (IList(GeometryObject))

---

|  |
| --- |
| DirectShapeType Class   See Also |

Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void AppendShape( 	IList<GeometryObject> pGeomArr ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AppendShape ( _ 	pGeomArr As IList(Of GeometryObject) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AppendShape( 	IList<GeometryObject^>^ pGeomArr ) ``` |

#### Parameters

pGeomArr
:   Type:  System.Collections.Generic IList   GeometryObject
     Shape expressed as a collection of GeometryObjects. The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.

# Remarks

The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be joined with the appended geometry. It is up to the caller to ensure that the combination of geometry will have the correct appearance in Revit.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | At least one member of pGeomArr does not satisfy DirectShapeType validation criteria. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShapeType Class

AppendShape Overload

Autodesk.Revit.DB Namespace

#### MaterialElement Property

---

|  |
| --- |
| GeometryElement Class   See Also |

Element describing the material from which this element is composed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Material MaterialElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MaterialElement As Material 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Material^ MaterialElement { 	Material^ get (); } ``` |

# See Also

GeometryElement Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| MEPConnectorInfo Class   See Also |

Releases all resources used by the  MEPConnectorInfo

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace

#### Execute Method

---

|  |
| --- |
| IExternalEventHandler Interface   See Also |

This method is called to handle the external event.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` void Execute( 	UIApplication app ) ``` |

| Visual Basic |
| --- |
| ``` Sub Execute ( _ 	app As UIApplication _ ) ``` |

| Visual C++ |
| --- |
| ``` void Execute( 	UIApplication^ app ) ``` |

#### Parameters

app
:   Type:  Autodesk.Revit.UI UIApplication

# See Also

IExternalEventHandler Interface

Autodesk.Revit.UI Namespace

#### Reset Method

---

|  |
| --- |
| CorrectionFactorSetIterator Class   See Also |

Bring the iterator back to the start of the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

CorrectionFactorSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### ShowMultipleRowsForMultiphaseCircuits Property

---

|  |
| --- |
| PanelScheduleData Class   See Also |

shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool ShowMultipleRowsForMultiphaseCircuits { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowMultipleRowsForMultiphaseCircuits As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowMultipleRowsForMultiphaseCircuits { 	bool get (); 	void set (bool value); } ``` |

# Remarks

only applicable to one column formats

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### TextureRealWorldOffsetX Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Offset X" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldOffsetX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldOffsetX As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldOffsetX { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### ExternalFileReferenceType Enumeration

---

|  |
| --- |
| See Also |

Enum class indicating kinds of external file references

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum ExternalFileReferenceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ExternalFileReferenceType ``` |

| Visual C++ |
| --- |
| ``` public enum class ExternalFileReferenceType ``` |

# Members

| Member name | Description |
| --- | --- |
| None | Uninitialized value |
| RevitLink | Revit linked files |
| CADLink | Linked CAD files |
| DWFMarkup | DWF markup files |
| KeynoteTable | The keynote table (The file which contains keynote information.) |
| Decal | Decals (images which appear only during rendering) |
| Material | Materials are not included as ExternalFileReferences in the 2012 release |
| AssemblyCodeTable | The assembly code table (The file which contains assembly code information.) |
| SystemsAnalysisReport | Systems analysis report file path |

# See Also

Autodesk.Revit.DB Namespace

#### WireTypeSet Class

---

|  |
| --- |
| Members   See Also |

A set that contains wire types.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class WireTypeSet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class WireTypeSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class WireTypeSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Electrical WireTypeSet

# See Also

WireTypeSet Members

Autodesk.Revit.DB.Electrical Namespace

#### PointNotInSurface Property

---

|  |
| --- |
| BuiltInFailures SiteFailures Class   See Also |

A Point is outside of the Surface boundary. Insert the Point on the boundary instead, and then drag it to the desired location.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PointNotInSurface { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointNotInSurface As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PointNotInSurface { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteFailures Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.StairRampFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about StairRamp.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class StairRampFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class StairRampFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class StairRampFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures StairRampFailures

# See Also

BuiltInFailures StairRampFailures Members

Autodesk.Revit.DB Namespace

#### IUpdater Interface

---

|  |
| --- |
| Members   Example   See Also |

The interface used to create an updater capable of reacting to changes in the Revit model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public interface IUpdater ``` |

| Visual Basic |
| --- |
| ``` Public Interface IUpdater ``` |

| Visual C++ |
| --- |
| ``` public interface class IUpdater ``` |

# Remarks

Implement this interface and register an instance of the derived class with the UpdaterRegistry.

# Examples

 Copy  C#

```
public class WallUpdaterApplication : Autodesk.Revit.UI.IExternalApplication
{
    public Result OnStartup(UIControlledApplication application)
    {
        // Register wall updater with Revit
        WallUpdater updater = new WallUpdater(application.ActiveAddInId);
        UpdaterRegistry.RegisterUpdater(updater);

        // Change Scope = any Wall element
        ElementClassFilter wallFilter = new ElementClassFilter(typeof(Wall));

        // Change type = element addition
        UpdaterRegistry.AddTrigger(updater.GetUpdaterId(), wallFilter,
                                    Element.GetChangeTypeElementAddition());
        return Result.Succeeded;
    }

    public Result OnShutdown(UIControlledApplication application)
    {
        WallUpdater updater = new WallUpdater(application.ActiveAddInId);
        UpdaterRegistry.UnregisterUpdater(updater.GetUpdaterId());
        return Result.Succeeded;
    }
}

public class WallUpdater : IUpdater
{
    static AddInId m_appId;
    static UpdaterId m_updaterId;
    WallType m_wallType = null;

    // constructor takes the AddInId for the add-in associated with this updater
    public WallUpdater(AddInId id)
    {
        m_appId = id;
        m_updaterId = new UpdaterId(m_appId, new Guid("FBFBF6B2-4C06-42d4-97C1-D1B4EB593EFF"));
    }

    public void Execute(UpdaterData data)
    {
        Document doc = data.GetDocument();

        // Cache the wall type
        if (m_wallType == null)
        {
            FilteredElementCollector collector = new FilteredElementCollector(doc);
            collector.OfClass(typeof(WallType));
            var wallTypes = from element in collector
                            where
                                element.Name == "Exterior - Brick on CMU"
                            select element;
            if (wallTypes.Count<Element>() > 0)
            {
                m_wallType = wallTypes.Cast<WallType>().ElementAt<WallType>(0);
            }
        }

        if (m_wallType != null)
        {
            // Change the wall to the cached wall type.
            foreach (ElementId addedElemId in data.GetAddedElementIds())
            {
                Wall wall = doc.GetElement(addedElemId) as Wall;
                if (wall != null)
                {
                    wall.WallType = m_wallType;
                }
            }
        }
    }

    public string GetAdditionalInformation()
    {
        return "Wall type updater example: updates all newly created walls to a special wall";
    }

    public ChangePriority GetChangePriority()
    {
        return ChangePriority.FloorsRoofsStructuralWalls;
    }

    public UpdaterId GetUpdaterId()
    {
        return m_updaterId;
    }

    public string GetUpdaterName()
    {
        return "Wall Type Updater";
    }
}
```

 Copy  VB.NET

```
Public Class WallUpdaterApplication
    Implements Autodesk.Revit.UI.IExternalApplication
    Public Function OnStartup(application As UIControlledApplication) As Autodesk.Revit.UI.Result Implements IExternalApplication.OnStartup
        ' Register wall updater with Revit
        Dim updater As New WallUpdater(application.ActiveAddInId)
        UpdaterRegistry.RegisterUpdater(updater)

        ' Change Scope = any Wall element
        Dim wallFilter As New ElementClassFilter(GetType(Wall))

        ' Change type = element addition
        UpdaterRegistry.AddTrigger(updater.GetUpdaterId(), wallFilter, Element.GetChangeTypeElementAddition())
        Return Result.Succeeded
    End Function

    Public Function OnShutdown(application As UIControlledApplication) As Autodesk.Revit.UI.Result Implements IExternalApplication.OnShutdown
        Dim updater As New WallUpdater(application.ActiveAddInId)
        UpdaterRegistry.UnregisterUpdater(updater.GetUpdaterId())
        Return Result.Succeeded
    End Function
End Class

Public Class WallUpdater
    Implements IUpdater
    Shared m_appId As AddInId
    Shared m_updaterId As UpdaterId
    Private m_wallType As WallType = Nothing

    ' constructor takes the AddInId for the add-in associated with this updater
    Public Sub New(id As AddInId)
        m_appId = id
        m_updaterId = New UpdaterId(m_appId, New Guid("FBFBF6B2-4C06-42d4-97C1-D1B4EB593EFF"))
    End Sub

    Public Sub Execute(data As UpdaterData) Implements IUpdater.Execute
        Dim doc As Document = data.GetDocument()

        ' Cache the wall type
        If m_wallType Is Nothing Then
            Dim collector As New FilteredElementCollector(doc)
            collector.OfClass(GetType(WallType))
            Dim wallTypes As System.Collections.Generic.IEnumerable(Of Autodesk.Revit.DB.Element)
            wallTypes = From element In collector _
             Where element.Name = "Exterior - Brick on CMU" _
             Select element
            If wallTypes.Count() > 0 Then
                m_wallType = wallTypes.Cast(Of WallType)().ElementAt(0)
            End If
        End If

        If m_wallType IsNot Nothing Then
            ' Change the wall to the cached wall type.
            For Each addedElemId As ElementId In data.GetAddedElementIds()
                Dim wall As Wall = TryCast(doc.GetElement(addedElemId), Wall)
                If wall IsNot Nothing Then
                    wall.WallType = m_wallType
                End If
            Next
        End If
    End Sub

    Public Function GetAdditionalInformation() As String Implements IUpdater.GetAdditionalInformation
        Return "Wall type updater example: updates all newly created walls to a special wall"
    End Function

    Public Function GetChangePriority() As ChangePriority Implements IUpdater.GetChangePriority
        Return ChangePriority.FloorsRoofsStructuralWalls
    End Function

    Public Function GetUpdaterId() As UpdaterId Implements IUpdater.GetUpdaterId
        Return m_updaterId
    End Function

    Public Function GetUpdaterName() As String Implements IUpdater.GetUpdaterName
        Return "Wall Type Updater"
    End Function
End Class
```

# See Also

IUpdater Members

Autodesk.Revit.DB Namespace

#### ShowHeader Property

---

|  |
| --- |
| ScheduleSortGroupField Class   See Also |

Indicates if a header row should be displayed before each group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool ShowHeader { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowHeader As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowHeader { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

True if a header row should be displayed, false otherwise.

# Remarks

The header row displays a title consisting of the value of the field that the schedule is grouped by.

# See Also

ScheduleSortGroupField Class

Autodesk.Revit.DB Namespace

#### GetAttachmentType Method

---

|  |
| --- |
| RebarUpdateCurvesData Class   See Also |

Returns attachment type for stirrups to be used in cover calculation.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public StirrupTieAttachmentType GetAttachmentType() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAttachmentType As StirrupTieAttachmentType ``` |

| Visual C++ |
| --- |
| ``` public: StirrupTieAttachmentType GetAttachmentType() ``` |

#### Return Value

InteriorFace : rebar to attach to interior face of cover reference.

ExteriorFace : rebar to attach to exterior face of cover reference.

# See Also

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace

#### PhyMaterialProperties Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Properties"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialProperties { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialProperties As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialProperties { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DetailCurveArrayIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public abstract class DetailCurveArrayIterator : APIObject,  	IEnumerator ``` |

| Visual Basic |
| --- |
| ``` Public MustInherit Class DetailCurveArrayIterator _ 	Inherits APIObject _ 	Implements IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public ref class DetailCurveArrayIterator abstract : public APIObject,  	IEnumerator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB DetailCurveArrayIterator

# See Also

DetailCurveArrayIterator Members

Autodesk.Revit.DB Namespace

#### SpaceInfiltrationAirflow Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Infiltration Airflow"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpaceInfiltrationAirflow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceInfiltrationAirflow As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpaceInfiltrationAirflow { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InvalidReflectivityPercentage Property

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   See Also |

The value for Reflectivity must be between 0 and 1.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidReflectivityPercentage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidReflectivityPercentage As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidReflectivityPercentage { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace

#### AddElementsToCustomConnection Method

---

|  |
| --- |
| StructuralConnectionHandlerType Class   Example   See Also |

Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler by adding representors of input elements or subelements.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static void AddElementsToCustomConnection( 	StructuralConnectionHandler structuralConnectionHandler, 	IList<Reference> references ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub AddElementsToCustomConnection ( _ 	structuralConnectionHandler As StructuralConnectionHandler, _ 	references As IList(Of Reference) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void AddElementsToCustomConnection( 	StructuralConnectionHandler^ structuralConnectionHandler,  	IList<Reference^>^ references ) ``` |

#### Parameters

structuralConnectionHandler
:   Type:  Autodesk.Revit.DB.Structure StructuralConnectionHandler
     The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.

references
:   Type:  System.Collections.Generic IList   Reference
     References to elements or subelements which are to be used to modify custom StructuralConnectionHandlerType by adding their representors.

# Remarks

Elements or subelements added to a custom connection are deleted and transformed in subelements of the connection. They could be:

* FamilyInstance (structural beams and columns).
* StructuralConnectionHandler elements associated to the connection.
* Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
  + OST\_StructConnectionWelds
  + OST\_StructConnectionHoles
  + OST\_StructConnectionModifiers
  + OST\_StructConnectionShearStuds
  + OST\_StructConnectionBolts
  + OST\_StructConnectionAnchors
  + OST\_StructConnectionPlates

You cannot add: elements connected by any connection handler, generic connections, holes and modifiers that are not on the connected elements.

# Examples

 Copy  C#

```
   // Select elements to add to connection.
   IList<Reference> refs = Utilities.Functions.SelectConnectionElementsCustom(activeDoc);

   if (refs.Count() <= 0)
   {
      return Result.Failed;
   }

   // Start transaction
   trans.Start();
   // Adding the elements to the custom connection, using Revit's StructuralConnectionHandlerType class
   StructuralConnectionHandlerType.AddElementsToCustomConnection(conn, refs);
   // Commit the transaction
   ts = trans.Commit();

   if (ts != TransactionStatus.Committed)
   {
      message = "Failed to commit the current transaction !";
      trans.RollBack();
      return Result.Failed;
   }
}
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Input StructuralConnectionHandler must have custom type. -or- All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections. -or- Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace

#### BindingMap Class

---

|  |
| --- |
| Members   See Also |

The parameters BindingMap contains all the parameter bindings that exist in the Autodesk Revit project.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class BindingMap : DefinitionBindingMap ``` |

| Visual Basic |
| --- |
| ``` Public Class BindingMap _ 	Inherits DefinitionBindingMap ``` |

| Visual C++ |
| --- |
| ``` public ref class BindingMap : public DefinitionBindingMap ``` |

# Remarks

The ParameterBindingsMap is available from the Document.ParameterBindings property. A parameter binding is the way that a parameter definition is bound to elements within one or more categories. This map can be used to interrogate existing bindings, but it can also be used to generate new parameter bindings by using the Insert method.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB DefinitionBindingMap
  Autodesk.Revit.DB BindingMap

# See Also

BindingMap Members

Autodesk.Revit.DB Namespace

#### TrueLoadPhaseC Property

---

|  |
| --- |
| ElectricalSystem Class   See Also |

The TrueLoadPhaseC value of the Electrical System.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double TrueLoadPhaseC { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TrueLoadPhaseC As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TrueLoadPhaseC { 	double get (); } ``` |

# Remarks

This property is used to retrieve the TrueLoadPhaseC value of the Electrical System.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This property only available when System Type is Power! |

# See Also

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace

#### RbsAreaBasedLoadType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Area Based Load Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsAreaBasedLoadType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsAreaBasedLoadType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsAreaBasedLoadType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ZoneHeatingSetPointParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Heating Set Point"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ZoneHeatingSetPointParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZoneHeatingSetPointParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ZoneHeatingSetPointParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| PlanViewRange Class   See Also |

View range for the current plane

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ElementId Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Current As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ElementId^ Current { 	ElementId^ get (); } ``` |

# See Also

PlanViewRange Class

Autodesk.Revit.DB Namespace

#### Title Property

---

|  |
| --- |
| Document Class   See Also |

The document's title.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public string Title { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Title As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Title { 	String^ get (); } ``` |

# Remarks

Title is derived from the document's filename, not including the filename extension. Note that returned title will be defaulted if no document saved. Note that returned string may be empty if a document is detached. See  IsDetached  .

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### StairsSupporttypeSectionProfile Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Section Profile": Section Profile

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsSupporttypeSectionProfile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsSupporttypeSectionProfile As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsSupporttypeSectionProfile { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ReferenceType Enumeration

---

|  |
| --- |
| See Also |

Reference types of curve element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ReferenceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ReferenceType ``` |

| Visual C++ |
| --- |
| ``` public enum class ReferenceType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| WeakReference |  |
| StrongReference |  |

# See Also

Autodesk.Revit.DB Namespace

#### MaxValue Property

---

|  |
| --- |
| VoltageType Class   See Also |

Get upper boundary of voltage value of this voltage definition, the unit is volt.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double MaxValue { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MaxValue As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double MaxValue { 	double get (); } ``` |

# See Also

VoltageType Class

Autodesk.Revit.DB.Electrical Namespace

#### FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, Element, Level, StructuralType)

---

|  |
| --- |
| FamilyInstanceCreationData Class   See Also |

Initializes a new instance of the  FamilyInstanceCreationData  class

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyInstanceCreationData( 	XYZ location, 	FamilySymbol symbol, 	Element host, 	Level level, 	StructuralType structuralType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	location As XYZ, _ 	symbol As FamilySymbol, _ 	host As Element, _ 	level As Level, _ 	structuralType As StructuralType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FamilyInstanceCreationData( 	XYZ^ location,  	FamilySymbol^ symbol,  	Element^ host,  	Level^ level,  	StructuralType structuralType ) ``` |

#### Parameters

location
:   Type:  Autodesk.Revit.DB XYZ
     The physical location where the instance is to be placed.

symbol
:   Type:  Autodesk.Revit.DB FamilySymbol
     A FamilySymbol object that represents the type of the instance that is to be inserted.

host
:   Type:  Autodesk.Revit.DB Element
     The object into which the FamilyInstance is to be inserted, often known as the host.

level
:   Type:  Autodesk.Revit.DB Level
     A Level object that is used as the base level for the object.

structuralType
:   Type:  Autodesk.Revit.DB.Structure StructuralType
     If structural then specify the type of the component.

# See Also

FamilyInstanceCreationData Class

FamilyInstanceCreationData Overload

Autodesk.Revit.Creation Namespace

#### RebarSystemSpanactiveDirn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bars In Minor Direction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemSpanactiveDirn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemSpanactiveDirn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemSpanactiveDirn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NewtonMetersPerMeter Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Newton meters per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NewtonMetersPerMeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NewtonMetersPerMeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NewtonMetersPerMeter { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### StartExtension Property

---

|  |
| --- |
| StairsPathType Class   See Also |

The start extension length of the stairs path.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double StartExtension { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StartExtension As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double StartExtension { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for startExtension must be between 0 and 30000 feet. |

# See Also

StairsPathType Class

Autodesk.Revit.DB.Architecture Namespace

#### RepeatingDetailRotation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Detail Rotation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RepeatingDetailRotation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RepeatingDetailRotation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RepeatingDetailRotation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| EdgeArrayArrayIterator Class   See Also |

Bring the iterator back to the start of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the array in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

EdgeArrayArrayIterator Class

Autodesk.Revit.DB Namespace

#### AdditionalLoad Property

---

|  |
| --- |
| ElectricalDemandFactorDefinition Class   See Also |

Additional load to be included during demand load calculation.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double AdditionalLoad { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AdditionalLoad As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double AdditionalLoad { 	double get (); 	void set (double value); } ``` |

# See Also

ElectricalDemandFactorDefinition Class

Autodesk.Revit.DB.Electrical Namespace

#### StairsLandingThickness Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Total Thickness": Thickness

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsLandingThickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsLandingThickness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsLandingThickness { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace